[
  {
    "id": 1,
    "name": "Việt Nam thời tiền sử",
    "description": "Việt Nam có một nền văn hóa đặc sắc, lâu đời và là một xã hội đã hình thành theo chế độ nhà nước sớm nhất ở khu vực Đông Nam Á.[1]\nVăn hóa Tràng An là một trong những nền văn hóa cổ nhất ở Việt Nam, hình thành từ thời kỳ đồ đá cũ khoảng 25 Ka BP (Kilo annum before present, ngàn năm trước).\nTràng An là tên một địa điểm ở Ninh Bình, nơi đầu tiên tìm ra những di chỉ của nền văn hóa này. Đến nay đã có khoảng 30 địa điểm thuộc nền văn hóa Tràng An đã được phát hiện, kết quả nhiều cuộc nghiên cứu của các chuyên gia khảo cổ học cho thấy dấu ấn của người tiền sử thích nghi với biến cố lớn về môi trường, cảnh quan ít nhất là từ khoảng 25 Ka BP, một số nền văn hóa tiền sử đã tiến hóa liên tục ở khu vực này, từ thời kỳ đồ đá cũ qua thời kỳ đồ đá mới đến thời kỳ đồ đồng và thời kỳ đồ sắt như nền văn hóa Tràng An, Hòa Bình và Đa Bút... Với những giá trị về văn hóa và thiên nhiên mang tính nổi bật toàn cầu, Tràng An, Ninh Bình được UNESCO vinh danh trở thành khu di sản thế giới kép đầu tiên ở Việt Nam và khu vực Đông Nam Á.[2]\n"
  },
  {
    "kingdom": "Quân chủ chuyên chế",
    "capital": "Ngàn Hống (~2879 TCN – ?) Nghĩa Lĩnh (Thế kỷ XXIX TCN) Phong Châu (Tới 258 TCN)",
    "id": 2,
    "name": "Hồng Bàng",
    "description": "Hồng Bàng thị (chữ Hán: 鴻龐氏) hay Thời đại Hồng Bàng là một giai đoạn lịch sử thuộc thời đại thượng cổ của lịch sử Việt Nam.\nThời đại này dựa nhiều trên các truyền thuyết, truyện kể ở những tác phẩm như Lĩnh Nam chích quái[1] và được hợp thức hóa trở thành một giai đoạn lịch sử qua Đại Việt sử ký toàn thư[2], cuốn sử thư đã đưa Hồng Bàng thị làm Kỷ đầu tiên.\nĐầu thời kỳ đồ đồng, người Việt gồm khoảng 15 nhóm Lạc Việt khác nhau sống trên vùng núi miền Bắc và miền châu thổ sông Hồng và hơn 12 nhóm Âu Việt sống ở vùng Đông Bắc, ngoài ra còn có một số nhóm người sinh sống trên các lưu vực sông thuộc khu vực Thanh Nghệ Tĩnh ngày nay. Để tiện việc trao đổi buôn bán, phòng chống lụt lội, chống lại kẻ thù... những bộ lạc Lạc Việt dần được gom lại thành một nước lấy tên Văn Lang và người đứng đầu tự xưng là Hùng Vương.\n"
  },
  {
    "id": 3,
    "name": "An Dương Vương",
    "description": "An Dương Vương (chữ Hán: 安陽王), tên thật là Thục Phán Thân (蜀审判体),[2] là người lập nên nước Âu Lạc, nhà nước thứ hai trong lịch sử Việt Nam sau nhà nước Văn Lang. Niên đại trị vì của An Dương Vương được các tài liệu ghi khác nhau. Sử cũ như Đại Việt sử ký toàn thư, Khâm định Việt sử thông giám cương mục cho rằng thời gian ông làm vua Âu Lạc kéo dài 50 năm, từ 257 TCN đến 208 TCN.[3] Các sử gia hiện đại căn cứ vào Sử ký Tư Mã Thiên là tài liệu gần thời đại nước Âu Lạc nhất, cho rằng An Dương Vương và nước Âu Lạc tồn tại từ khoảng 208 TCN đến 179 TCN, tức là gần 30 năm.[4].\nVào thời kỳ Hồng Bàng cách đây 2.300 năm, ở vùng Bắc bộ Việt Nam và phía Tây tỉnh Quảng Tây (Trung Quốc) có các bộ tộc người Âu Việt sống xen kẽ với người Lạc Việt. Nhà nước Văn Lang do Hùng Vương đứng đầu cai trị người Lạc Việt. Thục Phán là vua người Âu Việt, sau 1 cuộc xung đột (sử sách không ghi rõ chi tiết), ông đã đánh bại Hùng Vương, thống nhất hai tộc Âu Việt và Lạc Việt vào chung 1 triều đình. Ông đổi quốc hiệu thành Âu Lạc, xưng là An Dương Vương, đóng đô tại Phong Khê (nay là vùng Cổ Loa, huyện Đông Anh, Hà Nội). Có ca dao:\nBộ sử lâu đời nhất và gần thời An Dương Vương nhất là Sử ký Tư Mã Thiên chỉ nhắc tới nước Âu Lạc[5] mà không nhắc tới An Dương Vương. Cựu Đường thư (Hậu Tấn – Lưu Hú soạn năm 945 SCN) và Nam Việt chí (viết thời Lưu Tống 420 – 479) thì có nhắc tới An Dương Vương nhưng không ghi cụ thể họ tên của ông, chỉ ghi \"vua Thục đem ba vạn lính đánh diệt Hùng Vương đi. Vua Thục nhân đó cho con mình làm An Dương Vương, trị đất Giao Chỉ\". Như vậy cái tên “Thục Phán” có thể là không chính xác, mà chỉ là truyền thuyết đời sau đặt ra để dễ ghi danh cho An Dương Vương.\n"
  },
  {
    "kingdom": "Chế độ quân chủ",
    "capital": "Giao Chỉ",
    "id": 4,
    "name": "Thời kỳ Bắc thuộc lần thứ nhất",
    "description": "Bắc thuộc lần thứ nhất (chữ Nôm: 北屬吝次一, ngắn gọn: Bắc thuộc lần 1) trong lịch sử Việt Nam kéo dài từ khoảng thế kỷ thứ 2 trước Công nguyên đến năm 40, dưới sự cai trị của nhà Triệu và nhà Hán của nền phong kiến Trung Quốc.\nDấu mốc xác định thời kỳ đầu tiên này chưa thống nhất giữa các tài liệu, do quan niệm khác nhau về nước Nam Việt và nhà Triệu.\nSau khi sáp nhập Âu Lạc vào Nam Việt, Triệu Đà chia lãnh thổ Âu Lạc làm 2 quận Giao Chỉ và Cửu Chân. Trông coi 2 quận này là hai viên quan Sứ (đại diện cho triều đình Phiên Ngung), bao gồm: Điển sứ coi việc hành chính và Tả tướng coi việc quân sự.[9] Sử cũ ghi nhận Tả tướng cuối cùng thời Triệu là Hoàng Đồng (黄同).\n"
  },
  {
    "kingdom": "Phong kiến",
    "capital": "Phiên Ngung",
    "id": 5,
    "name": "Nhà Triệu",
    "description": "Nhà Triệu (chữ Hán: 趙朝; bính âm: Zhào cháo; Hán Việt: Triệu triều) là triều đại duy nhất cai trị nước Nam Việt (ngày nay gồm 1 phần của Miền Nam Trung Quốc và Miền Bắc Việt Nam) suốt giai đoạn 204–111 trước Công nguyên.\nNguồn gốc của nhà Triệu bắt nguồn từ Triệu Đà, một võ tướng của nhà Tần theo lệnh Tần Thủy Hoàng dẫn quân xuống chinh phạt phía Nam sông Trường Giang (khi đó là lãnh thổ của các bộ tộc Bách Việt). Ông chiếm được nhiều vùng lãnh thổ (bao gồm cả Quảng Đông và Quảng Tây), nhưng nhà Tần ở Trung Hoa đã diệt vong. Nhận thấy triều đình trung ương đã sụp đổ, Triệu Đà bèn tách ra cát cứ, dùng những lãnh thổ ông chiếm được để lập nên nước Nam Việt, sau đấy ông mở rộng xuống khu vực ngày nay thuộc Việt Nam. Sau khi nhà Hán làm chủ Trung Hoa, khi về già, Triệu Đà đã quyết định bỏ việc xưng Đế, quy phục nhà Hán (nhưng vẫn xưng Hoàng đế ở trong Nam Việt). Triệu Đà viết thư gửi cho vua Hán, trong thư Triệu Đà đã công nhận rằng mình là người Trung Hoa, nhà Triệu chỉ là chư hầu phục vụ cho nhà Hán, thay mặt hoàng đế Đại Hán để cai trị phía Nam, bản thân ông cũng chỉ coi những thần dân người Việt cổ là đám \"Man Di\" mà thôi.[1]\nToàn bộ về lịch sử nhà Triệu được chép đầu tiên bởi Sử ký nhà Hán, được đề cập chủ yếu trong phần Liệt truyện, quyển 113:[2] Biên niên sử Nam Việt (南越列傳). Nó lưu lại các thông tin về nước Nam Việt từ thời Triệu Đà cho đến khi cáo chung dưới thời Triệu Dương Vương.\n"
  },
  {
    "id": 6,
    "name": "Hai Bà Trưng",
    "description": "Hai Bà Trưng (13 tháng 9 năm 14 – 5 tháng 3 năm 43) là tên chỉ chung hai chị em Trưng Trắc (徵側) và Trưng Nhị (徵貳), hai người phụ nữ được đánh giá là anh hùng dân tộc của người Việt.[5] Trong sử sách, hai bà được biết đến như là những thủ lĩnh khởi binh chống lại chính quyền đô hộ của Đông Hán, lập ra một quốc gia với kinh đô tại Mê Linh và Trưng Trắc tự phong là Nữ vương. Thời kì của hai Bà xen giữa thời kỳ Bắc thuộc lần 1 và Bắc thuộc lần 2 trong lịch sử Việt Nam. Đại Việt sử ký toàn thư coi Trưng Trắc là một vị vua trong lịch sử, với tên gọi Trưng Nữ vương (徵女王).\nNguồn sử liệu đầu tiên đề cập đến chị em Hai Bà Trưng là cuốn Hậu Hán Thư viết vào thế kỷ thứ 5 (Công nguyên) bởi học giả Phạm Diệp, cuốn sách nói về lịch sử nhà Hán từ năm 6 đến năm 189 Công nguyên. Các tài liệu cổ của Trung Quốc đề cập đến hai chị em Bà Trưng khá ngắn gọn, được tìm thấy trong hai chương của Hậu Hán Thư mô tả về cuộc khởi nghĩa của Hai Bà thời kỳ nhà Tây Hán.\nỞ quyển 86 của Hậu Hán Thư, phần \"Tây Nam di liệt truyện\" có viết:[6]\n"
  },
  {
    "kingdom": "Chế độ quân chủ",
    "capital": "Long Biên",
    "id": 7,
    "name": "Thời kỳ Bắc thuộc lần thứ hai",
    "description": "Bắc thuộc lần thứ hai (chữ Nôm: 北屬吝次二, ngắn gọn: Bắc thuộc lần 2) trong lịch sử Việt Nam kéo dài khoảng 500 năm từ năm 43 đến năm 543, từ khi Mã Viện theo lệnh Hán Quang Vũ Đế nhà Đông Hán đánh chiếm lại bộ Giao Chỉ từ tay Trưng Vương, đến khi Lý Bí khởi binh đánh đuổi thứ sử[1] nhà Lương là Tiêu Tư năm 542 rồi lập ra nước Vạn Xuân năm 544.\nSau khi Cuộc khởi nghĩa Hai Bà Trưng thất bại, nhà Đông Hán tiếp tục duy trì sự cai trị tại bộ Giao Chỉ nhưng xoá bỏ sự tự trị địa phương. Vào cuối thế kỷ 2, nhà Đông Hán suy yếu, chiến tranh quân phiệt bùng nổ. Hán Hiến Đế bị các quyền thần thay nhau khống chế.\nTrước tình hình đó, Thái thú[2] quận Giao Chỉ là Sĩ Nhiếp xin nhà Hán cho 3 người em là Sĩ Nhất, Sĩ Vĩ và Sĩ Vũ làm thái thú các quận: Sĩ Nhất làm Thái thú Hợp Phố, Sĩ Vĩ làm Thái thú Cửu Chân, Sĩ Vũ làm Thái thú Nam Hải. Triều đình nhà Đông Hán do rối loạn trong nước không thể quản lý bộ Giao Chỉ xa xôi nên mặc nhiên thừa nhận. Từ đó thế lực họ Sĩ ở Giao Chỉ rất lớn.\n"
  },
  {
    "id": 8,
    "name": "Bà Triệu",
    "description": "Bà Triệu (chữ Hán: 趙婆, còn gọi là Triệu Ẩu, Triệu Trinh Nương, Triệu Thị Trinh hay Triệu Quốc Trinh, 226 – 248) là một thủ lĩnh kháng chiến thế kỷ thứ 3 tại Việt Nam.\nNăm 226, Sĩ Nhiếp mất, vua Đông Ngô là Tôn Quyền bèn chia đất từ Hợp Phố về bắc thuộc Quảng Châu dùng Lã Đại làm thứ sử; từ Hợp Phố về nam là Giao Châu, sai Đới Lương làm thái thú; và sai Trần Thì làm thái thú quận Giao Chỉ. Lúc bấy giờ, con của Sĩ Nhiếp là Sĩ Huy tự nối ngôi và xưng là thái thú, liền đem binh chống lại.\nThứ sử Lã Đại bèn xua quân sang đánh. Do nghe lời chiêu dụ, Sỹ Huy cùng năm anh em ra hàng. Lã Đại đem chém tất cả rồi đem đầu gửi về Vũ Xương. Dư đảng của Sỹ Huy tiếp tục chống lại, khiến Lã Đại mang quân vào Cửu Chân giết hại một lúc hàng vạn người.\n"
  },
  {
    "kingdom": "Chế độ quân chủ",
    "capital": "Long Biên",
    "id": 9,
    "name": "Nhà Tiền Lý",
    "description": "Nhà Tiền Lý (chữ Nôm: 茹前李, chữ Hán: 前李朝, Hán Việt: Tiền Lý triều, 544 – 602) là một triều đại trong lịch sử Việt Nam, gắn liền với quốc hiệu Vạn Xuân. Nhà Tiền Lý kéo dài 61 năm và nước Vạn Xuân kéo dài 58 năm, tổng cộng ba đời vua, trong đó có hai vua họ Lý và một vua họ Triệu cũng được tính gộp vào nhà Tiền Lý, tương tự như Dương Tam Kha trong nhà Ngô sau đó.\nLý Bí (503 – 548) là người thôn Cổ Pháp, xã Tiên Phong, huyện Phổ Yên (nay là phường Tiên Phong, TP. Phổ Yên), tỉnh Thái Nguyên. Ông là người có công đánh đuổi quân đô hộ nhà Lương (thời Nam Bắc triều), sáng lập ra nhà Tiền Lý. Ông cũng có một người anh là Lý Thiên Bảo.\nMột trong số tổ tiên của Lý Bí là con cháu Bách Việt, cuối thời Tây Hán khổ về việc đánh dẹp, mới tránh sang ở đất phương Nam, được bảy đời thì thành người Nam. Sử chép Lý Bí vốn con nhà hào trưởng, thiên tư lỗi lạc, do làm quan không được vừa ý nên cáo quan về quê, tập hợp nhân tài lo khởi nghĩa.\n"
  },
  {
    "id": 10,
    "name": "Triệu Việt Vương",
    "description": "Triệu Việt Vương (chữ Hán: 趙越王; 524 – 571), tên thật là Triệu Quang Phục (趙光復), là một trong những nhà lãnh đạo khởi nghĩa, giành tự chủ thời Bắc thuộc ở Việt Nam cai trị từ năm 548 đến năm 571. Ông có công kế tục Lý Nam Đế đánh đuổi quân xâm lược nhà Lương, giữ nền độc lập cho nước Vạn Xuân. Năm 571, ông bị Lý Phật Tử đánh úp và thua trận. Ông tự tử ở cửa sông Đáy.\nTriệu Quang Phục là con của Thái phó Triệu Túc, người huyện Chu Diên (nay thuộc huyện Khoái Châu, tỉnh Hưng Yên). Ông được sử sách mô tả là người uy tráng dũng liệt[1]. Ông cùng cha theo Lý Nam Đế khởi nghĩa từ ngày đầu (541), có công lao đánh đuổi quân Lương về nước, được giao chức Tả tướng quân nước Vạn Xuân.\nTháng 5 năm 545, quân Lương do Dương Phiêu và Trần Bá Tiên[2] chỉ huy lại sang đánh Vạn Xuân. Lý Nam Đế giao chiến bất lợi. Năm 546, sau khi thua trận phải lui về động Khuất Lão, Lý Nam Đế đã ủy thác cho ông giữ việc nước, điều quân đi đánh Trần Bá Tiên của nhà Lương[1].\n"
  },
  {
    "kingdom": "Chế độ quân chủ",
    "capital": "Đại La",
    "id": 11,
    "name": "Thời kỳ Bắc thuộc lần thứ ba",
    "description": "Bắc thuộc lần thứ ba (chữ Nôm: 北屬吝次三, ngắn gọn: Bắc thuộc lần 3) trong lịch sử Việt Nam kéo dài từ năm 602 đến năm 905 hoặc năm 939. Thời kỳ này bắt đầu khi Tùy Văn Đế sai Lưu Phương đánh chiếm nước Vạn Xuân, bức hàng Hậu Lý Nam Đế, kéo dài cho đến khi Khúc Thừa Dụ tiến vào Đại La, giành quyền cai quản toàn bộ Tĩnh Hải quân năm 905 - thời Đường Ai Đế, ông vua bù nhìn trong tay quyền thần Chu Ôn.\nNăm 602, nhà Tùy sai Lưu Phương đem quân 27 dinh sang đánh nước Vạn Xuân. Vua đời thứ ba của Vạn Xuân là Lý Phật Tử sợ giặc và đầu hàng, bị bắt sang Trung Hoa. Việt Nam vào thời kỳ Bắc thuộc lần thứ 3 mà trước hết là thuộc Tùy. Thời đó, Việt Nam bị xếp làm một châu của Tùy, gọi là châu Giao (交州). Trên đường đánh Lâm Ấp quay về, Lưu Phương mắc bệnh chết.\nSau Lưu Phương, đến Khâu Hòa được cử làm đại tổng quản. Năm 618, nhà Đường lật đổ nhà Tùy, lập ra nước Đại Đường. Khâu Hòa xin thần phục nhà Đường năm 622. Việt Nam thành thuộc địa của Đại Đường.\n"
  },
  {
    "id": 12,
    "name": "Mai Hắc Đế",
    "description": "Mai Hắc Đế (chữ Hán: 梅黑帝; 670 – 723), tên thật là Mai Thúc Loan (梅叔鸞),[1] là vị vua lãnh đạo cuộc khởi nghĩa chống lại sự chiếm đóng của nhà Đường ở miền Bắc Việt Nam vào đầu thế kỉ thứ 8.[2] Trong lịch sử Việt Nam, ông được xem như một vị anh hùng dân tộc.\nMai Thúc Loan sinh vào năm Canh Ngọ (670) tại thôn Ngọc Trừng, Hoan Châu, nay thuộc huyện Nam Đàn, Nghệ An. Theo Việt điện u linh, cha của Mai Thúc Loan là Mai Hoàn, mẹ là Mai An Hòa nguyên gốc Lộc Hà, Hà Tĩnh, lưu lạc sang vùng Nam Đàn, Nghệ An.[3]\nTheo sách Việt sử tiêu án, Mai Thúc Loan là người làng Hương Lãm, huyện Nam Đường, nay là thị trấn Nam Đàn, tỉnh Nghệ An, dân lập đền thờ ông ở thôn chợ Sa Nam.[2]\n"
  },
  {
    "id": 13,
    "name": "Phùng Hưng",
    "description": "Phùng Hưng[2][3][4] (chữ Hán: 馮興; 746-789[1]/791[5]/802) , là lãnh tụ một cuộc nổi dậy chống lại sự đô hộ của nhà Đường thời Bắc thuộc lần thứ ba (602–905) trong lịch sử Việt Nam.\nBộ dã sử Việt điện u linh tập của Lý Tế Xương (nhà Trần) viết năm 1329 được cho là nguồn tham khảo chính của Đại Việt sử ký toàn thư trong ghi chép về Phùng Hưng. Việt điện u linh tập truyện Bố Cái đại vương viết:\n“Xét Giao Châu Ký của Triệu Vương chép rằng: Vương họ Phùng tên Hưng, thế tập Biên Khố Di Tù Trưởng châu Đường Lâm, hiệu là Quan Lang (man tục nay còn). Vương gia tư hào hữu, sức lực dũng mãnh, đánh được hổ, vật được trâu; người em tên là Hãi cũng có sức mạnh kỳ dị, vác được một tảng đá nặng mười nghìn cân, hay một chiếc thuyền con chở nghìn hộc mà đi hơn mười dặm; mọi người thấy vậy đều kinh hãi. Giữa niên hiệu Đại Lịch nhà Đường, nhân nước An Nam ta có quân loạn, anh em đem nhau đi tuần các ấp lân cận đều hạ được cả, đi đến đâu thì chỗ ấy tan tác. Đắc chí rồi, Hưng cải danh là Cự Lão, Hải cũng đổi tên là Cự Lực; Vương hiệu là Đô Quán, Hãi hiệu là Đô Bảo, dùng kế hoạch của người Đường Lâm là Đỗ Anh Hậu đem binh tuần hành mấy châu Đường Lâm, Trường Phong, thảy đều quy thuận cả; uy danh chấn động, dương ngôn muốn đánh lấy Đô Hộ Phủ. Lúc bấy giờ quan Đô Hộ là Cao Chính Bình đem binh dưới trướng ra đánh không hơn được, ưu phẫn phát bệnh vàng da mà chết. Vương vào Đô Phủ thị sự bảy năm rồi mất; dân chúng muốn lập Phùng Hãi lên nối ngôi. Có kẻ phụ tá đầu mục là Bồ Phá Lặc, sức có thể bài sơn cử đỉnh, dũng lực tuyệt luân, có ý không theo mới lập con Vương là An, rồi đem quân chống Hãi; Hãi tránh Bồ Phá Lặc, dời qua ở động Chu Nham, sau đấy không biết ra sao nữa. An tôn Hưng là Bố Cái Đại Vương, bởi quốc tục xưng cha là “Bố”, mẹ là “Cái” nên mới gọi như vậy. An lên kế vị được hai năm, vua Đức Tông phong Triệu Xương sang làm An Nam đô hộ; Xương sang đến nơi, trước hết sai Sứ đem nghi vật dụ An; An sửa sang nghi vệ, đem quân nghênh hàng hiệu, các thân thuộc họ Phùng giải tán hết.\n"
  },
  {
    "id": 14,
    "name": "Thời kỳ tự chủ Việt Nam",
    "description": "Tự chủ là thời kỳ đầu khôi phục lại nền độc lập của Việt Nam đầu thế kỷ 10 sau hơn 1000 năm Bắc thuộc. Thời kỳ này, người Việt đã tự cai trị lãnh thổ nhưng chưa xưng làm vua, và chưa đặt quốc hiệu. Bề ngoài, Việt Nam vẫn là một phần lãnh thổ của \"thiên triều\" phương Bắc ở Trung nguyên với tên gọi \"Tĩnh Hải quân\" và người đứng đầu chỉ nối tiếp nhau làm chức Tiết độ sứ như một quan cai trị của Trung Quốc trước đây.\nThời kỳ tự chủ bắt đầu từ khi họ Khúc nổi dậy nắm quyền thay các Tiết độ sứ người Trung Quốc (905) và kết thúc khi Ngô Quyền tiêu diệt Kiều Công Tiễn và đánh thắng quân Nam Hán, lập ra nhà Ngô (938).\nTới đầu thế kỷ X, Việt Nam đã trải qua hơn 1000 năm Bắc thuộc. Sau khi nhà Tiền Lý dựng nước Vạn Xuân tồn tại được 60 năm thế kỷ VI, Việt Nam nằm dưới quyền cai trị của nhà Tùy và nhà Đường từ năm 602. Những cuộc nổi dậy chống lại của người Việt trong hơn 300 năm đều không thành công hoặc tồn tại ít lâu lại bị người phương Bắc trấn áp.\n"
  },
  {
    "id": 15,
    "name": "Họ Khúc (lịch sử Việt Nam)",
    "description": "Họ Khúc là dòng họ nắm quyền cai trị Việt Nam đầu thế kỷ X, mở đầu Thời kỳ tự chủ Việt Nam sau hơn 1000 năm Bắc thuộc. Họ Khúc truyền nối làm chức Tiết độ sứ gồm 3 đời: Khúc Thừa Dụ, Khúc Hạo, Khúc Thừa Mỹ, cai trị từ năm 905 tới năm 923 hoặc 930.\nCuối thế kỷ IX, chính quyền trung ương nhà Đường suy yếu nghiêm trọng. Nạn cát cứ của quân phiệt địa phương ngày càng ác liệt, khởi nghĩa Hoàng Sào (874-884) làm triều đình nhà Đường càng thêm suy yếu.\nĐầu thế kỷ X, nhà Đường rơi vào tay quyền thần Chu Ôn, các thế lực cát cứ nổi lên đánh giết lẫn nhau, tạo ra thế chia cắt 5 đời 10 nước (Ngũ đại Thập quốc). Năm 905, ở Tĩnh Hải quân (tên gọi Việt Nam lúc đó), Tiết độ sứ Độc Cô Tổn mới sang đã rất độc ác mất lòng người, bị gọi là \"Ngục Thượng thư\" (thượng thư ác). Tổn lại không cùng phe với Chu Ôn nên chỉ vài tháng lại bị Chu Ôn dời tiếp ra đảo Hải Nam và giết. Tĩnh Hải quân do đó không có người cai quản.\n"
  },
  {
    "id": 16,
    "name": "Dương Đình Nghệ",
    "description": "Dương Đình Nghệ (chữ Hán: 楊廷藝), có sách như Việt Nam sử lược của Trần Trọng Kim chép là Dương Diên Nghệ (楊筵藝, 22 tháng 11 năm 874[cần dẫn nguồn] – 937)[1], người Ái châu, làm tướng cho Khúc Hạo. Đời Hậu Lương, vì Khúc Hạo chiếm cứ đất Giao Châu, nên Nam Hán Cao Tổ Lưu Nghiễm ở đất Quảng Châu, có cớ sai Lý Khắc Chính và Lý Tri Thuận đánh chiếm Giao Châu. Kết quả của cuộc chiến này là con trai Khúc Hạo là Khúc Thừa Mỹ bị bắt, và vua Nam Hán phong Lý Tiến thay làm Thứ sử Giao Châu. Thấy vậy, tướng Dương Đình Nghệ dấy binh lên, đánh bại được Lý Khắc Chính, và vây hãm Lý Tiến. Và khi Lý Tiến được tướng Nam Hán là Trần Bảo đem quân tới cứu, Dương Đình Nghệ một lần nữa đánh bại và chém chết được Trần Bảo. Cuối cùng là Dương Đình Nghệ đã vẻ vang giữ được thành, và oai phong tự xưng là Tiết độ sứ của Giao Châu. Sáu năm sau, Dương Đình Nghệ, tuy thắng được ngoại xâm nhưng lại chết vì nội phản, bị tướng của mình là Kiều Công Tiễn làm phản, giết chết rồi lên thay.[2][3]\nDo chữ diên (延 hoặc 筵) và chữ đình 廷 gần giống nhau nên có sự \"tam sao thất bản\".\nĐại Việt sử ký toàn thư, ngoại kỷ, Quyển V chép là Dương Đình Nghệ kèm ghi chú: \"Cương mục ghi Dương Diên Nghệ, người Ái Châu, tức Thanh Hóa (CMTB5, 17a). Tài liệu Trung Quốc như Tống sử (q. 488), Tư trị thông giám v.v... cũng chép là Dương Diên Nghệ. Ngũ đại sử (q. 65) chép như Toàn thư (là Đình Nghệ). Có thể nhầm nét chữ vì chữ 延 diên và chữ 廷 đình gần giống nhau.\"\n"
  },
  {
    "id": 17,
    "name": "Kiều Công Tiễn",
    "description": "Kiều Công Tiễn (chữ Hán: 矯公羨 hoặc 皎公羨; 870 - 938) là người Phong Châu (Phú Thọ, Việt Nam), là Tĩnh Hải quân Tiết độ sứ (một chức quan đời nhà Đường) cuối cùng cai trị lãnh thổ Việt Nam trong thời kỳ Tự chủ từ năm 937 đến năm 938. Hậu duệ của ông sau này trở thành 2 trong số 12 sứ quân ở khu vực Phong Châu là Kiều Công Hãn và Kiều Thuận.\nKiều Công Tiễn vốn là hào trưởng Phong Châu (Phú Thọ) từ thời họ Khúc tự chủ. Khi vua Nam Hán xâm chiếm Tĩnh Hải quân (tên gọi Việt Nam lúc đó), bắt Khúc Thừa Mỹ, tướng cũ của họ Khúc là Dương Đình Nghệ tập hợp lực lượng ở Ái châu để chống Hán.\nKiều Công Tiễn đến theo Dương Đình Nghệ và được Dương Đình Nghệ dùng làm gia tướng. Một số tài liệu nói rằng Dương Đình Nghệ nhận tất cả 3.000 tráng sĩ đến đầu quân làm \"con nuôi\" (nghĩa tử) và Kiều Công Tiễn cũng ở trong số đó.\n"
  },
  {
    "kingdom": "Quân chủ",
    "capital": "Cổ Loa",
    "id": 18,
    "name": "Nhà Ngô",
    "description": "Nhà Ngô (chữ Nôm: 茹吳, chữ Hán: 吳朝, Hán Việt: Ngô triều) là một triều đại quân chủ trong lịch sử Việt Nam, truyền được hai đời nhưng có tới ba vị vua, kéo dài từ năm 939 đến năm 965. Khoảng thời gian xen giữa từ 944 đến 950 còn có Dương Bình Vương tức Dương Tam Kha. Khác với các triều đại quân chủ Việt Nam sau này, các vua nhà Ngô vẫn xưng tước vương mà chưa xưng đế hiệu trên phạm vi toàn lãnh thổ do họ cai trị.\nSau khi tiêu diệt nhà Tùy, nhà Đường tiếp tục sửa sang chế độ hành chính và sự phân chia châu quận, tiếp tục cai trị An Nam. Cho đến giữa thế kỷ IX, nhà Đường có biến loạn, ngày càng suy yếu. Lợi dụng thời cơ đó, Khúc Thừa Dụ là một hào trưởng người Việt ở Hồng Châu đã tập hợp nhân dân nổi dậy vào năm 905. Khúc Thừa Dụ đánh đuổi quan lại và binh lính nhà Đường, chiếm giữ phủ thành, xưng Tiết độ sứ. Đầu năm 906, nhà Đường buộc phải công nhận Khúc Thừa Dụ làm Tiết độ sứ An Nam.\nKhúc Thừa Dụ làm Tiết độ sứ được hai năm thì mất, con trai là Khúc Hạo lên thay. Khúc Hạo quyết định xây dựng đất nước tự chủ theo đường lối \"Chính sự cốt chuộng khoan dung, giản dị, nhân dân đều được yên vui\". Khúc Hạo đã làm được nhiều việc lớn: đặt lại các khu vực hành chính, cử người trông coi mọi việc đến tận xã; xem xét và định lại mức thuế, bãi bỏ các thứ lao dịch của thời Bắc thuộc; lập lại sổ hộ khẩu;... Tất cả những việc làm của Khúc Hạo đều nhằm mục đích mang lại cuộc sống ấm no, yên bình, hạnh phúc cho nhân dân.\n"
  },
  {
    "id": 19,
    "name": "Loạn 12 sứ quân",
    "description": "Loạn 12 sứ quân (chữ Nôm: 亂12使君; chữ Hán: 十二使君之亂, Thập nhị sứ quân chi loạn) là một giai đoạn nội chiến diễn ra vào cuối thời nhà Ngô, kéo dài từ năm 944 sau khi Ngô Quyền mất cho đến khi Đinh Bộ Lĩnh thống nhất đất nước, lập ra nhà Đinh năm 968, được ghi chép trong phần Bản kỷ Ngô sứ quân Ngô Xương Xí.\nCuộc loạn lạc này có nguyên nhân sâu xa từ quá trình phân hóa xã hội thời Bắc thuộc, dẫn đến việc xuất hiện tầng lớp thổ hào, quan lại có thế lực mạnh về kinh tế, chính trị và tạo ra sự phân tán cát cứ. Thực chất của cuộc nội chiến này là việc đấu tranh giành quyền lực tối cao trên đất Tĩnh Hải quân của các thủ lĩnh địa phương khi nhà Đường suy yếu, người Việt có cơ hội đứng lên tranh giành quyền lãnh đạo. Giai đoạn này có mầm mống từ đầu thế kỷ X và có cơ hội phát triển mạnh từ khi Dương Tam Kha cướp ngôi nhà Ngô, các nơi không chịu thuần phục, các thủ lĩnh nổi lên cát cứ một vùng, nhiều người còn xưng Vương như An vương Ngô Nhật Khánh, Vũ Ninh vương Nguyễn Thủ Tiệp, Quang Hiển quốc vương Kiều Thuận, Quảng Trí quân Nguyễn Khoan hoặc tranh ngôi vua như Lã Xử Bình, Dương Huy, Đỗ Cảnh Thạc, Kiều Công Hãn và đem quân đánh chiếm lẫn nhau.\nGiai đoạn 12 sứ quân kéo dài hơn 20 năm (944–968) và kết thúc khi Đinh Tiên Hoàng thống nhất đất nước, lập ra nhà nước Đại Cồ Việt – Nhà nước phong kiến tập quyền đầu tiên trong lịch sử của nước Việt Nam. Giống với thời Xuân Thu – Chiến Quốc của Trung Quốc và Chiến Quốc (Nhật Bản) của Nhật Bản, giai đoạn này cũng có thể coi là một thời kỳ chiến quốc của Việt Nam.\n"
  },
  {
    "kingdom": "Quân chủ",
    "capital": "Hoa Lư",
    "id": 20,
    "name": "Nhà Đinh",
    "description": "Đối với các định nghĩa khác, xem Đinh (định hướng).\nNhà Đinh (chữ Nôm: 茹丁, chữ Hán: 丁朝, Hán Việt: Đinh triều) là triều đại quân chủ phong kiến trong lịch sử Việt Nam bắt đầu năm 968, sau khi Đinh Tiên Hoàng dẹp xong loạn 12 sứ quân thống nhất đất nước và kết thúc năm 980 khi con của Đinh Tiên Hoàng là Đinh Phế Đế nhường ngôi cho Lê Hoàn.\nNhà Đinh là triều đại mở đầu chế độ phong kiến tập quyền và thời kỳ tự chủ với một chế độ đứng đầu bởi một Hoàng đế của nước Việt Nam.[1] Vương triều nhà Đinh đã mở nền chính thống cho thời đại phong kiến độc lập cho nên trong các bộ chính sử kể từ Đại Việt sử ký toàn thư thế kỷ XV, Đại Việt sử ký tiền biên thế kỷ XVIII đến Khâm định Việt sử thông giám cương mục thế kỷ XIX thì triều đại này đều được các tác giả lấy làm mốc mở đầu phần Bản kỷ hoặc Chính biên. Tiếp đến, việc xưng đế hiệu Đại Thắng Minh Hoàng đế của Đinh Tiên Hoàng mang ý thức lớn về sự tự tôn của nước Việt, có hàm ý so sánh với các Hoàng đế Trung Hoa.[2]\n"
  },
  {
    "kingdom": "Quân chủ",
    "capital": "Hoa Lư",
    "id": 21,
    "name": "Nhà Tiền Lê",
    "description": "Nhà Lê (chữ Nôm: 茹黎, chữ Hán: 黎朝, Hán Việt: Lê triều), hay còn được gọi là nhà Tiền Lê (chữ Nôm: 家前黎, Chữ Hán: 前黎朝, Hán Việt: Tiền Lê triều)[2] là một triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Đinh Phế Đế nhường ngôi cho Lê Hoàn vào năm 980, trải qua ba đời quân chủ và chấm dứt khi Lê Long Đĩnh qua đời. Quốc hiệu vẫn là Đại Cồ Việt.\nTriều đại này được kế tục bởi nhà Lý, được sáng lập bởi Lý Công Uẩn.\nSau khi Đinh Tiên Hoàng và con là Đinh Liễn bị ám hại, Vệ Vương Toàn lên ngôi, Lê Hoàn làm phụ chính, xưng là Phó vương. Triều thần sợ Lê Hoàn cướp ngôi vị của Thiếu đế, nên các công thần là Định Quốc công Nguyễn Bặc và Ngoại giáp Đinh Điền dẫn quân về kinh đô định giết Lê Hoàn. Lực lượng này thua trận và bị Lê Hoàn giết.\n"
  },
  {
    "kingdom": "Quân chủ",
    "capital": "Hoa Lư (1009 - 1010) Thăng Long (1010 - 1225)",
    "id": 22,
    "name": "Nhà Lý",
    "description": "Nhà Lý (chữ Nôm: 茹李, chữ Hán: 李朝, Hán Việt: Lý triều), đôi khi gọi là nhà Hậu Lý (để phân biệt với triều đại Tiền Lý do Lý Bí thành lập) là một triều đại trong nền quân chủ Việt Nam. Triều đại này bắt đầu khi Lý Công Uẩn lên ngôi vào tháng 10 âm lịch năm 1009 sau khi giành được quyền lực từ tay nhà Tiền Lê. Triều đại này trải qua 9 vị hoàng đế và chấm dứt khi Lý Chiêu Hoàng, lúc đó mới có 7 tuổi, bị ép thoái vị để nhường ngôi cho chồng là Trần Cảnh vào năm 1225 – tổng cộng là 216 năm.\nTrong thời đại này, lần đầu tiên nhà Lý đã giữ vững được chính quyền một cách lâu dài đến hơn 200 năm, khác với các vương triều cũ trước đó chỉ tồn tại hơn vài chục năm. Vào năm 1054, Lý Thánh Tông đã đổi quốc hiệu từ Đại Cồ Việt (大瞿越) thành Đại Việt (大越), mở ra kỷ nguyên Đại Việt rực rỡ nhất trong lịch sử Việt Nam.\nTrong nước, mặc dù các vị Hoàng đế đều sùng bái Phật giáo nhưng ảnh hưởng của Nho giáo cũng rất cao với việc mở các trường đại học đầu tiên là Văn miếu (1070) và Quốc Tử giám (1076) và tổ chức các khoa thi để chọn người hiền tài không có nguồn gốc xuất thân là quý tộc ra giúp nước. Khoa thi đầu tiên được mở vào năm 1075, và Trạng nguyên đầu tiên là Lê Văn Thịnh. Về thể chế chính trị, đã có sự phân cấp quản lý rõ ràng hơn và sự cai trị đã dựa nhiều vào pháp luật hơn là sự chuyên quyền độc đoán của cá nhân. Sự kiện nhà Lý chọn thành Đại La làm kinh đô, đổi tên thành Thăng Long (昇龍) đã đánh dấu sự cai trị dựa vào sức mạnh kinh tế và lòng dân hơn là sức mạnh quân sự để phòng thủ như các triều đại trước. Những danh thần như Lê Văn Thịnh, Bùi Quốc Khái, Doãn Tử Tư, Đoàn Văn Khâm, Lý Đạo Thành, Tô Hiến Thành,... đã góp sức lớn về văn trị và chính trị, tạo nên một nền văn hiến rực rỡ của triều đại nhà Lý.\n"
  },
  {
    "id": 23,
    "name": "Lịch sử Việt Nam thời Lý",
    "description": ""
  },
  {
    "kingdom": "Quân chủ chuyên chế",
    "capital": "Thăng Long Thiên Trường[1] Thanh Hoá (tạm thời)",
    "id": 24,
    "name": "Nhà Trần",
    "description": "Nhà Trần (chữ Nôm: 茹陳, chữ Hán: 陳朝, Hán Việt: Trần triều) là một triều đại quân chủ cai trị nước Đại Việt từ năm 1226 đến năm 1400. Đây là triều đại được lưu danh với những chiến công hiển hách trong lịch sử Việt Nam. Triều đại này khởi đầu khi Trần Cảnh lên ngôi vào năm 1226 sau khi được vợ là Lý Chiêu Hoàng truyền ngôi. Những năm đầu tiên, Trần Cảnh còn nhỏ tuổi, toàn bộ quyền hành của nhà Trần đều do một tông thất vai chú của Trần Cảnh là Trần Thủ Độ nắm quyền, chính Trần Thủ Độ đã âm thầm ép Lý Chiêu Hoàng nhường ngôi cho cháu mình.\nTrong giai đoạn nắm giữ quyền lực, nhà Trần vẫn đóng đô ở Thăng Long – kinh đô triều cũ, tiếp tục mở rộng và phát triển sự hưng thịnh có từ đời nhà Lý. Về chính sách chính trị, các Hoàng đế nhà Trần cũng xây dựng bộ máy chính quyền hoàn thiện hơn so với nhà Lý, họ tạo nên một hệ thống đặc biệt, trong đó các Hoàng đế sẽ sớm nhường ngôi cho Thái tử mà lui về làm Thái thượng hoàng, tuy nhiên vẫn cùng vị Hoàng đế mới điều hành chính sự. Việc này được đánh giá là tích cực, khi ngôi Hoàng đế sớm có chủ, tránh được việc tranh giành ngôi vua như nhà Lý trước đó; và bản thân vị Hoàng đế sẽ tiếp xúc và làm quen việc cai trị cho đến khi trưởng thành. Các mặt kinh tế, xã hội, giáo dục và nghệ thuật cũng hoàn chỉnh hơn và cho thấy Nho giáo, Đạo giáo đã có ảnh hưởng rõ rệt tới triều đại, tạo ra cục diện Tam giáo đồng nguyên, sự cân bằng ảnh hưởng của Phật giáo – Nho giáo – Đạo giáo. Thái Thượng hoàng Trần Nhân Tông được coi là một danh nhân văn hóa nổi tiếng, người bảo trợ Phật giáo và Đạo giáo, thành lập Thiền phái Trúc Lâm Yên Tử nổi tiếng và truyền đến đời nay. Bên cạnh đó, những danh thần Đoàn Nhữ Hài, Mạc Đĩnh Chi, Nguyễn Hiền, Nguyễn Trung Ngạn, Trương Hán Siêu, Chu Văn An, Trần Quang Triều,... là những cái tên nổi danh về tri thức, thơ văn, góp phần to lớn tạo nên thời kỳ nhà Trần hưng thịnh văn hóa.\nDưới triều nhà Trần, lực lượng quân đội đặc biệt được chú trọng phát triển đủ sức đánh dẹp các cuộc nội loạn và đương đầu với quân đội các nước xung quanh. Lực lượng quân đội nhà Trần thiện chiến nhất là thủy binh, rồi kỵ binh, bộ binh, tượng binh... Chính sách chia thực ấp cho các thân tộc trong họ, mỗi thế lực trong dòng tộc đều có quân đội tinh nhuệ là nền tảng lớn khiến quân đội nhà Trần đánh bại được cuộc xâm phạm của quân đội Nhà Nguyên, Đế quốc Mông Cổ qua 3 lần vào năm 1258, 1285 và 1287. Nhiều tôn thất hoàng gia như Chiêu Minh Đại vương Trần Quang Khải, Chiêu Văn Đại vương Trần Nhật Duật, Hưng Đạo Đại vương Trần Quốc Tuấn và Nhân Huệ vương Trần Khánh Dư đều là những tướng cầm quân tài ba, có vai trò quan trọng trong chiến thắng vào năm 1285 và 1287.\n"
  },
  {
    "id": 25,
    "name": "Lịch sử Việt Nam thời Trần",
    "description": ""
  },
  {
    "kingdom": "Quân chủ",
    "capital": "Tây Đô 20°4′B 105°36′Đ﻿ / ﻿20,067°B 105,6°Đ﻿ / 20.067; 105.600",
    "id": 26,
    "name": "Nhà Hồ",
    "description": "Nhà Hồ (chữ Nôm: 茹胡, chữ Hán: 胡朝, Hán Việt: Hồ triều) là một triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Hồ Quý Ly lên ngôi năm 1400 sau khi giành được quyền lực từ tay nhà Trần và chấm dứt khi Hồ Hán Thương bị quân Minh bắt vào năm 1407 – tổng cộng là 7 năm. Quốc hiệu Đại Việt đã đổi thành Đại Ngu năm 1400.\nNhà Hồ do Hồ Quý Ly, một đại quý tộc và đại thần nhà Trần thành lập. Từ năm 1371, Hồ Quý Ly, khi đó mang họ Lê, được tham gia triều chính nhà Trần, được vua Trần Dụ Tông cho làm Trưởng cục Chi hậu. Sau, vua Trần Nghệ Tông đưa ông lên làm Khu mật đại sứ, lại gả em gái là công chúa Huy Ninh.\nSau biến cố Dương Nhật Lễ, cái chết của Trần Duệ Tông và sự cướp phá của Chiêm Thành, nhà Trần ngày càng suy sụp. Thời hậu kỳ nhà Trần, mọi việc chính sự do Thượng hoàng Trần Nghệ Tông quyết định. Trần Nghệ Tông lại rất trọng dụng Hồ Quý Ly nên khi về già thường ủy thác mọi việc cho Quý Ly quyết định. Dần dần binh quyền của Quý Ly ngày một lớn, Nghệ Tông tuổi cao sức yếu cũng không kìm chế nổi.\n"
  },
  {
    "id": 27,
    "name": "Lịch sử Việt Nam thời Hồ",
    "description": ""
  },
  {
    "kingdom": "Quân chủ",
    "id": 28,
    "name": "Thời kỳ Bắc thuộc lần thứ tư",
    "description": "Thời kỳ Bắc thuộc lần thứ tư (chữ Nôm: 北屬吝次四) hay còn gọi là thời Minh thuộc trong lịch sử Việt Nam bắt đầu từ năm 1407 khi đế quốc Minh đánh bại nhà Hồ-Đại Ngu và chấm dứt năm 1427 khi Lê Lợi đánh đuổi được quân Minh ra khỏi bờ cõi, giành thắng lợi hoàn toàn trong cuộc khởi nghĩa Lam Sơn. Thời kỳ thuộc Minh chỉ kéo dài 20 năm.\nTrong những năm đầu thành lập triều Minh, Minh Thái Tổ Chu Nguyên Chương đã công khai chính sách hòa hoãn với các quốc gia nhỏ, giáp biên giới với Trung Quốc. Thậm chí, Minh Thái Tổ còn đặt ra danh sách các nước mà Trung Quốc không nên chinh phạt trong chính sách Bất chinh chư di quốc danh (不征諸夷國名 - Các nước man di không nên đánh). Nước Đại Việt (mà \"Thiên triều\" Trung Quốc quen gọi là An Nam) được đặt đầu tiên trong các nước hướng tây nam Trung Quốc.\nTại Đại Việt, cuối thế kỷ XIV nhà Trần sa sút, Phụ chính Thái sư Lê Quý Ly dần dần kiểm soát cả triều đình, đưa ra nhiều biện pháp thanh trừng những người trung thành với triều Trần. Lê Quý Ly đổi họ Hồ, soán ngôi nhà Trần, lên làm vua năm 1400, đặt tên nước là Đại Ngu, bắt đầu thực hiện nhiều cải tổ trong hệ thống chính trị và xã hội. Tuy nhiên, do thực hiện quá nhiều thay đổi trong thời gian ngắn, lại không được nhiều cựu thần nhà Trần cũng như dân chúng ủng hộ, lại thêm tình hình kinh tế và xã hội suy yếu vì nhiều nguyên nhân, nên đất nước rơi vào khủng hoảng.\n"
  },
  {
    "kingdom": "Quân chủ chuyên chế",
    "capital": "Mô Độ (1407 - 1409) Bình Than (1409 - 1414)",
    "id": 29,
    "name": "Nhà Hậu Trần",
    "description": "Hậu Trần (chữ Nôm: 茹後陳, chữ Hán: 後陳朝, Hán Việt: Hậu Trần triều) là một triều đại trong lịch sử Việt Nam từ 1407 đến 1414 mà các sách sử vẫn chưa thống nhất cách gọi. Sách Đại Việt sử ký toàn thư thì gọi là nhà Hậu Trần, còn Khâm định Việt sử Thông giám cương mục thì hoàn toàn không nhắc đến cụm từ này mà chỉ thuật lại sự việc trong những năm tháng ấy. Ở đây, viết theo sách Đại Việt sử ký toàn thư nên gọi là nhà Hậu Trần.\nNhà Hậu Trần do Giản Định đế - Trần Ngỗi (một hậu duệ của hoàng tộc nhà Trần) thành lập tháng 10 âm lịch năm 1407 tại Ninh Bình sau khi nhà nước Đại Ngu của nhà Hồ bị quân đội nhà Minh xâm chiếm và tiêu diệt. Trong thời kỳ này, nước Đại Ngu bị nhà Minh đổi tên trở lại thành Giao Chỉ và chia thành 17 phủ, 5 châu và 12 vệ trực thuộc Ty Bố Chính.\nDo quân mới lập, Giản Định đế phải chạy vào Nghệ An, viên Đại tri châu Hóa châu là Đặng Tất giết quan nhà Minh, dẫn quân từ Hóa châu ra theo phò, nhà Hậu Trần làm chủ từ Nghệ An vào Thăng Hoa (vào vùng nay thuộc Quảng Nam và Bắc Quảng Ngãi). Năm 1408, quân Hậu Trần tiến quân ra Bắc, đánh bại quân Minh ở trận Bô Cô, bao vây các thành. Năm 1409, Giản Định đế giết 2 tướng Đặng Tất, Nguyễn Cảnh Chân, khiến cho 2 người con của họ là Đặng Dung và Nguyễn Cảnh Dị bất mãn, kéo quân mình trở về Nghệ An lập Trần Quý Khoáng lên làm Trùng Quang đế. Trùng Quang đế sai Nguyễn Súy bắt được Giản Định đế. Nhà vua Trùng Quang đế bèn tôn Giản Định Đế làm Thái thượng hoàng để cùng nhau tiến quân đánh quân Minh. Tuy chiến thắng lúc đầu, quân nhà Hậu Trần sau này dần dà thất thế, phải lui về phía Nam và tới năm 1414 thì thất bại hoàn toàn.\n"
  },
  {
    "id": 30,
    "name": "Khởi nghĩa Lam Sơn",
    "description": "Khởi nghĩa Lam Sơn (1418–1427) là cuộc khởi nghĩa đánh đuổi quân Minh xâm lược về nước do Lê Lợi lãnh đạo và kết thúc bằng việc thành lập trở lại nước Đại Việt và sự thành lập nhà Hậu Lê\nTrong giai đoạn đầu (1418–1423), nghĩa quân Lam Sơn gặp rất nhiều khó khăn, thường hứng chịu các cuộc càn quét của quân Minh và quân Ai Lao, chịu tổn thất lớn. Các tướng Lam Sơn là Lê Lai và Lê Thạch tử trận. Quân Lam Sơn bấy giờ chỉ có thể thắng những trận nhỏ. Nghĩa quân bắt đầu giành thế thượng phong khi Lê Lợi nghe theo Nguyễn Chích, tiến quân ra đất Nghệ An vào năm 1424. Sau nhiều trận đánh lớn với quân Minh do các tướng Minh và cộng sự người Việt chỉ huy, quân Lam Sơn giải phóng hầu hết vùng đất từ Thanh Hóa vào Thuận Hóa, siết chặt vòng vây các thành chưa đầu hàng. Ở giai đoạn cuối, sau khi tích lũy được lực lượng, quân Lam Sơn lần lượt chuyển đại quân ra Bắc, thực hiện chiến lược cơ động, buộc quân Minh phải co cụm để giữ các thành trì quan trọng. Đặc biệt với chiến thắng quyết định trong trận Tốt Động – Chúc Động, quân Lam Sơn giành được thế chủ động trên chiến trường và sự ủng hộ của dân chúng vốn khiếp sợ trước uy thế của quân Minh trước đó. Tiếp nối thắng lợi, cuối năm 1427, quân Lam Sơn triển khai chiến dịch Chi Lăng – Xương Giang, đánh tan tác lực lượng viện binh quân Minh, buộc tướng chỉ huy quân Minh trên đất Việt cũ là Vương Thông phải xin giảng hòa và được phép rút quân về nước. Sau chiến thắng, Bình Định vương Lê Lợi sai văn thần Nguyễn Trãi viết bài Bình Ngô đại cáo để tuyên cáo cho toàn quốc.[3][4] Nước Đại Việt được khôi phục, Lê Lợi lên ngôi Hoàng đế, đặt niên hiệu Thuận Thiên, mở ra cơ nghiệp nhà Lê trong gần 400 năm sau đó.\nSau khi đánh bại nhà Hồ, nhà Minh đặt ách đô hộ lên nước Việt, đặt nước Việt trở thành quận Giao Chỉ.[5] Người Việt lập tức nổi lên chống quân Minh, mà lớn nhất là của nhà Hậu Trần, đã có những thời điểm tưởng chừng có thể khôi phục lại giang sơn của người Việt. Tuy nhiên, do sự thiếu đoàn kết giữa các thủ lĩnh quân nổi dậy người Việt, quân Minh vừa mua chuộc gây chia rẽ, vừa khủng bố trấn áp rất tàn bạo (chặt đầu, đốt xác, cuốn ruột vào cây...), hòng đè bẹp mọi ý chí phản kháng của người Việt.[6] Mặc dù vậy, dưới sự cai trị tàn bạo, khắc nghiệt của nhà Minh, người Việt rất oán hận, luôn ấp ủ chờ thời cơ nổi dậy.[7][8]\n"
  },
  {
    "id": 31,
    "name": "Nhà Hậu Lê",
    "description": "Nhà Hậu Lê (chữ Nôm: 茹後黎, chữ Hán: 後黎朝, Hán Việt: Hậu Lê triều; (1428-1789) là một triều đại phong kiến Việt Nam tồn tại sau thời Bắc thuộc lần 4 và đồng thời với nhà Mạc, nhà Tây Sơn trong một thời gian, trước Nhà Nguyễn\nNhà Hậu Lê doLê Lợi lập ra. Nó được phân biệt với nhà Tiền Lê (980–1009) do Lê Hoàn lập ra cuối thế kỷ X. Nhà Hậu Lê gồm 2 giai đoạn:\nThời kỳ này của Lê Trung Hưng còn được gọi là Nam Bắc triều, nhà Lê và nhà Mạc chia đôi nước Đại Việt. Khi nhà Mạc bị đánh bại phải chạy lên Cao Bằng (1592 tới năm 1677) thì công thần có công đánh Mạc là họ Trịnh đã nắm hết quyền hành. Công thần họ Nguyễn không thần phục họ Trịnh, ly khai ở phía nam, do đó phần lớn hậu kỳ thời Lê Trung hưng, nước Đại Việt lại bị chia cắt bởi chúa Trịnh và chúa Nguyễn, gọi là Trịnh Nguyễn phân tranh.\n"
  },
  {
    "kingdom": "Quân chủ tuyệt đối",
    "capital": "Đông Kinh (東京 1428 - 1527)",
    "id": 32,
    "name": "Nhà Lê sơ",
    "description": "Nhà Lê sơ (chữ Nôm: 茹黎初 chữ Hán: 黎初朝, Hán Việt: Lê sơ triều) là giai đoạn đầu của triều đại quân chủ nhà Hậu Lê. Đây là thời kỳ mà chế độ quân chủ chuyên chế tập quyền trong lịch sử Việt Nam lần đầu tiên đạt đến đỉnh cao của sự phát triển cũng như suy thoái của nó. Nhà Lê sơ được thành lập sau khi Lê Lợi phát động Khởi nghĩa Lam Sơn đánh bại nhà Minh. Ông đổi tên Giao Chỉ (交阯), vốn tồn tại trong thời gian nội thuộc nhà Minh, trở về Đại Việt (大越), quốc hiệu có từ đời Lý Thánh Tông.\nThời đại Lê sơ có 10 vị hoàng đế thuộc 6 thế hệ, đây là thời kỳ các hoàng đế nhà Lê nắm trọn được quyền hành, cũng là thời kỳ vĩ đại, hoàng kim của chế độ phong kiến Việt Nam. Đời Lê Thái Tổ (Lê Lợi) và đặc biệt là đời Lê Thái Tông, xã hội được đi vào ổn định, phát triển thịnh vượng một cách mau chóng sau thời kỳ chiến tranh trước đó.\nDưới thời Lê Thánh Tông, Đại Việt phát triển cực thịnh về mọi mặt từ kinh tế, văn hóa, xã hội, giáo dục, quân sự. Nước Đại Việt từ trước chưa bao giờ cường thịnh và mạnh mẽ, có sức ảnh hưởng toàn khu vực lớn bằng thời này, thời kỳ này được gọi là Hồng Đức thịnh thế (洪德晟世)[cần dẫn nguồn], tính đến ảnh hưởng các đời sau là Lê Hiến Tông, Lê Túc Tông, là hơn 30 năm.\n"
  },
  {
    "id": 33,
    "name": "Lịch sử Việt Nam thời Lê sơ",
    "description": ""
  },
  {
    "kingdom": "Chế độ quân chủ",
    "capital": "Vạn Lại (tạm thời) (1533–1597) Đông Kinh (1597–1789)",
    "id": 34,
    "name": "Nhà Lê trung hưng",
    "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm.\nTừ thời Lê Uy Mục và Lê Tương Dực, chính sự nhà Hậu Lê bắt đầu suy. Các cuộc khởi nghĩa nông dân và sự tranh chấp quyền lực trong nội bộ khiến nhà Lê nghiêng ngả. Năm 1516, giữa lúc đang đối phó với lực lượng khởi nghĩa của Trần Cảo sắp đánh vào kinh thành thì trong cung đình nhà Lê xảy ra phế lập. Đại thần Trịnh Duy Sản giết chết vua Lê Tương Dực và lập vua mới Lê Chiêu Tông, mang xa giá vào Thanh Hóa.\nSau khi Trần Cảo bị đánh bật khỏi kinh thành Thăng Long, các quyền thần Trịnh Tuy, Nguyễn Hoằng Dụ, Trần Chân chia bè phái đánh lẫn nhau. Tình hình tạm yên, Trần Chân trở thành người nắm binh quyền. Chiêu Tông bất bình với quyền hành của Trần Chân bèn giết chết Trần Chân. Các thủ hạ của Trần Chân là Nguyễn Kính, Nguyễn Ánh khởi binh báo thù cho chủ.\n"
  },
  {
    "kingdom": "Chế độ quân chủ",
    "capital": "Vạn Lại (tạm thời) (1533–1597) Đông Kinh (1597–1789)",
    "id": 35,
    "name": "Nhà Lê trung hưng",
    "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm.\nTừ thời Lê Uy Mục và Lê Tương Dực, chính sự nhà Hậu Lê bắt đầu suy. Các cuộc khởi nghĩa nông dân và sự tranh chấp quyền lực trong nội bộ khiến nhà Lê nghiêng ngả. Năm 1516, giữa lúc đang đối phó với lực lượng khởi nghĩa của Trần Cảo sắp đánh vào kinh thành thì trong cung đình nhà Lê xảy ra phế lập. Đại thần Trịnh Duy Sản giết chết vua Lê Tương Dực và lập vua mới Lê Chiêu Tông, mang xa giá vào Thanh Hóa.\nSau khi Trần Cảo bị đánh bật khỏi kinh thành Thăng Long, các quyền thần Trịnh Tuy, Nguyễn Hoằng Dụ, Trần Chân chia bè phái đánh lẫn nhau. Tình hình tạm yên, Trần Chân trở thành người nắm binh quyền. Chiêu Tông bất bình với quyền hành của Trần Chân bèn giết chết Trần Chân. Các thủ hạ của Trần Chân là Nguyễn Kính, Nguyễn Ánh khởi binh báo thù cho chủ.\n"
  },
  {
    "kingdom": "Chế độ quân chủ",
    "capital": "Vạn Lại (tạm thời) (1533–1597) Đông Kinh (1597–1789)",
    "id": 36,
    "name": "Nhà Lê trung hưng",
    "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm.\nTừ thời Lê Uy Mục và Lê Tương Dực, chính sự nhà Hậu Lê bắt đầu suy. Các cuộc khởi nghĩa nông dân và sự tranh chấp quyền lực trong nội bộ khiến nhà Lê nghiêng ngả. Năm 1516, giữa lúc đang đối phó với lực lượng khởi nghĩa của Trần Cảo sắp đánh vào kinh thành thì trong cung đình nhà Lê xảy ra phế lập. Đại thần Trịnh Duy Sản giết chết vua Lê Tương Dực và lập vua mới Lê Chiêu Tông, mang xa giá vào Thanh Hóa.\nSau khi Trần Cảo bị đánh bật khỏi kinh thành Thăng Long, các quyền thần Trịnh Tuy, Nguyễn Hoằng Dụ, Trần Chân chia bè phái đánh lẫn nhau. Tình hình tạm yên, Trần Chân trở thành người nắm binh quyền. Chiêu Tông bất bình với quyền hành của Trần Chân bèn giết chết Trần Chân. Các thủ hạ của Trần Chân là Nguyễn Kính, Nguyễn Ánh khởi binh báo thù cho chủ.\n"
  },
  {
    "id": 37,
    "name": "Lịch sử Việt Nam thời Lê trung hưng",
    "description": ""
  },
  {
    "kingdom": "Quân chủ",
    "capital": "Đông Kinh",
    "id": 38,
    "name": "Nhà Mạc",
    "description": "Nhà Mạc (chữ Hán: 莫朝 / Mạc triều) là triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Mạc Đăng Dung, sau khi dẹp được các bè phái trong cung đình, đã ép vua Lê Cung Hoàng nhà Hậu Lê nhường ngôi tháng 6 năm 1527 và chấm dứt khi vua Mạc Mậu Hợp lập con trai là Mạc Toàn lên ngôi, bị quân đội Lê-Trịnh do Trịnh Tùng chỉ huy đánh bại vào cuối năm 1592 – Sau đó Mạc Toàn lên ngôi nhưng tại vị chỉ được 2 tháng, tổng cộng thời gian tồn tại chính thức của triều đại là gần 66 năm.\nTuy nhiên, giai đoạn sau đó hậu duệ nhà Mạc như Mạc Kính Chỉ, Mạc Kính Cung, Mạc Kính Khoan, Mạc Kính Vũ vẫn còn tiếp tục chống lại nhà Hậu Lê thời kỳ trung hưng đến tận năm 1677[1] tại khu vực Cao Bằng.\nThời kỳ 1533-1592 trong lịch sử Việt Nam còn được gọi là thời kỳ Nam-Bắc triều, do chính quyền nhà Mạc chỉ thực sự có quyền lực từ địa phận Ninh Bình ngày nay trở ra, còn từ Thanh Hóa trở vào là thế lực lấy danh nghĩa gây dựng lại nhà Lê từ năm 1533.\n"
  },
  {
    "id": 39,
    "name": "Lịch sử Việt Nam thời Mạc",
    "description": ""
  },
  {
    "kingdom": "Quân chủ chuyên chế",
    "capital": "Đông Kinh",
    "id": 40,
    "name": "Chúa Trịnh",
    "description": "Chúa Trịnh (chữ Nôm: 主鄭, chữ Hán: 鄭王 / Trịnh vương; 1545 – 1787) là một vương tộc phong kiến kiểm soát quyền lực lãnh thổ Đàng Ngoài suốt thời Lê Trung hưng. Về danh nghĩa thì chúa Trịnh là bề tôi của nhà Lê (họ chỉ xưng tước \"vương\", vẫn dùng niên hiệu và nhận sắc phong, chiếu chỉ từ hoàng đế nhà Lê). Tuy nhiên thực tế thì vua Lê không có thực quyền, việc cai trị chủ yếu do chúa Trịnh thực hiện. Bộ máy triều đình lúc này hoạt động theo thể chế lưỡng đầu. Tổng cộng có 11 đời chúa Trịnh chính thức (nếu tính luôn cả Trịnh Kiểm là 12 đời chúa), cai quản xứ Đàng Ngoài trong hơn 2 thế kỷ.\nSau khi hoàng đế Lê Hiến Tông mất năm 1504, các hoàng đế kế vị đều yểu mạng, hoặc tàn bạo, hoặc kém tài. Đến năm 1527, quyền thần Mạc Đăng Dung cướp hoàng vị của Lê Cung Hoàng rồi sáng lập nhà Mạc. Năm 1533, ở Thanh Hóa, một võ tướng nhà Lê là Nguyễn Kim nổi dậy chống lại nhà Mạc, lập lại nhà Lê, ông tìm được hậu duệ của nhà Lê là Lê Ninh bèn lập làm hoàng đế tức là Lê Trang Tông. Trong vòng 5 năm, các vùng phía nam nằm dưới quyền kiểm soát của nhà Lê Trung Hưng nhưng họ không thể chiếm Thăng Long. Trong thời gian này, nhà Lê cũng phát triển thế lực về phía Nam, chiếm quyền kiểm soát vùng cực nam lãnh thổ nơi từng là đất đai của Chăm Pa.\nNgười mở đầu sự nghiệp của họ Trịnh là Trịnh Kiểm, người huyện Vĩnh Lộc, Thanh Hóa. Tương truyền thuở nhỏ nhà Trịnh Kiểm nghèo, hàng xóm rất ghét, nhân khi Trịnh Kiểm đi vắng bèn bắt mẹ ông ném xuống vực. Trịnh Kiểm về không thấy mẹ đâu bèn đi tìm, đến vực tìm ra xác mẹ thì mối đã xông đầy lên rồi. Sau có ông thầy tướng đi qua chỉ vào ngôi mộ mẹ Trịnh Kiểm đọc rằng:\n"
  },
  {
    "kingdom": "Quân chủ chuyên chế",
    "capital": "Ái Tử-Trà Bát (1558-1626) Phước Yên-Bác Vọng (1626-1636, 1712-1738) Kim Long-Phú Xuân (1636-1712, 1738-1775) Hội An (1775-1777) Gia Định (1777, 1780-1783, 1788-1802)",
    "id": 41,
    "name": "Chúa Nguyễn",
    "description": "Chúa Nguyễn (chữ Nôm: 主阮; chữ Hán: 阮王 / Nguyễn vương) (1558-1777, 1780-1802) là tên gọi dùng để chỉ người đứng đầu xứ Đàng Trong tức dải đất từ Thuận Hóa (phía nam đèo Ngang hiện nay) trở vào miền Nam của Việt Nam, đối lập với xứ Đàng Ngoài của các Chúa Trịnh trong thời kỳ Trịnh-Nguyễn phân tranh của lịch sử Việt Nam. Các Chúa Nguyễn bắt đầu từ đầu giai đoạn Lê Trung hưng của Nhà Hậu Lê, hay giữa thế kỷ XVI, cho đến khi bị Nhà Tây Sơn tiêu diệt vào năm 1777, tuy nhiên Nguyễn Phúc Ánh. một hậu duệ của Chúa Nguyễn đã xưng vương và đến năm 1802 thì tiêu diệt Tây Sơn và lập ra triều đại mới thông qua việc xưng đế. Các Chúa Nguyễn chính là tổ tiên của các Hoàng đế Nhà Nguyễn (1802-1945).\nNăm 1527, Mạc Đăng Dung soán ngôi Nhà Lê và lập ra Nhà Mạc. Nguyễn Kim (1468–1545), vốn là một tướng giỏi của Nhà Hậu Lê, nhờ có công giúp vua Lê chống lại Nhà Mạc nên được phong chức Thái sư Hưng Quốc công (sau này khi Nhà Nguyễn thành lập đã truy tôn ông là Triệu tổ Tĩnh hoàng đế). Nguyễn Kim có ba người con. Con gái đầu tên Ngọc Bảo, lấy Trịnh Kiểm, người sau này trở thành người mở đầu cho sự nghiệp của các Chúa Trịnh ở Đàng Ngoài; hai người con trai kế của Nguyễn Kim cũng là tướng giỏi và được phong chức Quận công. Sau khi người con trai lớn là Nguyễn Uông bị anh rể là Trịnh Kiểm giết, người con trai còn lại là Nguyễn Hoàng đã xin vua Lê cho vào cai trị vùng đất Thuận Hóa để rời xa sự kiểm soát của anh rể mà nhằm mưu đồ tạo dựng 1 cơ nghiệp riêng cho dòng họ Nguyễn, việc này dẫn đến sự chia cắt với Chúa Trịnh ở miền Bắc vào năm 1627 và hai miền chỉ được thống nhất khi quân Tây Sơn lúc đấy đang đi theo chúa Trịnh tạm thời tiêu diệt chúa Nguyễn vào năm 1777. Năm 1744, Chúa Nguyễn Phúc Khoát tự xưng tước vị \"vương\" để chứng tỏ hoàn toàn quyền lực ngang hàng với Chúa Trịnh và chỉ đứng dưới Hoàng đế Đại Việt (tức vua Nhà Lê Trung hưng).\nCác Chúa Nguyễn về danh nghĩa là quan lại của Nhà Lê Trung hưng. Họ vẫn nhận sắc phong và dùng niên hiệu của vua Lê, vẫn tuyên bố mình là bề tôi trung thành của Nhà Lê, có nhiệm vụ giúp vua Lê cai quản vùng lãnh thổ phía Nam của nước Đại Việt, dù trên thực tế họ cai trị lãnh thổ Đàng Trong một cách tương đối độc lập, ít khi nhận mệnh lệnh từ vua Lê. Tổng cộng có 9 chúa Nguyễn cai quản xứ Đàng Trong trong hơn 2 thế kỷ cho tới khi bị lật đổ vào năm 1777. Tình trạng chia cắt Việt Nam thành Đàng Trong (của Chúa Nguyễn) với Đàng Ngoài (của các Chúa Trịnh) kéo dài suốt khoảng thời gian đó. Đến khoảng cuối thế kỷ XVIII, Chúa Nguyễn Phúc Khoát bỏ bê chính sự, triều chính rối ren khiến lòng dân chán ghét, việc này đã tạo ra điều kiện cho quân Tây Sơn nổi dậy và đánh đổ Chúa Nguyễn.\n"
  },
  {
    "id": 42,
    "name": "Trịnh–Nguyễn phân tranh",
    "description": "Trịnh–Nguyễn phân tranh (chữ Hán: 鄭阮紛爭) là thời kỳ phân chia lãnh thổ giữa chế độ \"vua Lê chúa Trịnh\" ở phía Bắc sông Gianh (Đàng Ngoài) và chúa Nguyễn cai trị ở miền Nam (Đàng Trong), mở đầu khi Trịnh Tráng đem quân đánh Nguyễn Phúc Nguyên năm 1627 và kết thúc vào năm 1777 khi chúa Nguyễn sụp đổ.\nBan đầu, cả thế lực họ Trịnh và họ Nguyễn đều mang khẩu hiệu \"phù Lê diệt Mạc\" để lấy lòng thiên hạ và thề trung thành với triều Hậu Lê. Sau khi nhà Mạc đã bị đánh đổ, trên danh nghĩa, cả Chúa Trịnh và Chúa Nguyễn đều là 2 vị bề tôi của nhà Hậu Lê, cả Đàng Trong lẫn Đàng Ngoài đều là lãnh thổ của nhà Lê. Nhưng trên thực tế thì cả hai tập đoàn phong kiến này đều tạo thế lực cát cứ cho riêng mình như 2 nước riêng biệt, vua nhà Hậu Lê đã không còn thực quyền nên không ngăn chặn được sự phân tranh giữa hai họ Trịnh–Nguyễn. Nước Đại Việt trong giai đoạn này bị chia cắt khoảng 150 năm.\nNăm 1527, Mạc Đăng Dung cướp ngôi nhà Hậu Lê lập ra nhà Mạc. Năm 1533, tướng cũ của nhà Lê là Nguyễn Kim lập con vua Lê Chiêu Tông lên ngôi, tức là Lê Trang Tông. Năm 1545, Nguyễn Kim bị sát hại, con rể là Trịnh Kiểm lên thay. Để nắm trọn binh quyền, Trịnh Kiểm đầu độc giết con cả của Nguyễn Kim là Nguyễn Uông. Em của ông là Nguyễn Hoàng lo sợ bị anh rể hại, nên nghe theo lời khuyên của Nguyễn Bỉnh Khiêm, xin vào trấn thủ Thuận Hóa. Trịnh Kiểm cho rằng đất ấy là nơi xa xôi, hoang vu nên đồng ý cho đi, với hy vọng rằng khi đụng độ với quân nhà Mạc, Nguyễn Hoàng sẽ bị giết chết dưới tay chúng. Tuy nhiên, ngạc nhiên thay, Nguyễn Hoàng không những đánh bại được quân nhà Mạc, mà lại còn lấy được lòng dân Thuận Hóa nữa.\n"
  },
  {
    "kingdom": "Quân chủ chuyên chế",
    "capital": "Quy Nhơn (1778-1788) Phú Xuân (1788-1802) Phượng Hoàng Trung Đô (1788-1802)",
    "id": 43,
    "name": "Nhà Tây Sơn",
    "description": "Nhà Tây Sơn (chữ Nôm: 家西山, chữ Hán: 西山朝 / Tây Sơn triều) là một triều đại quân chủ trong lịch sử Việt Nam tồn tại từ năm 1778 đến năm 1802, được thành lập trong bối cảnh tranh chấp quyền lực cuối thời Lê Trung hưng (1533–1789). Theo cách gọi của phần lớn sử gia, nhất là các sử gia hiện đại[1] tại Việt Nam thì \"nhà Tây Sơn\" được dùng để gọi triều đại của anh em Nguyễn Nhạc, Nguyễn Lữ và Nguyễn Huệ để phân biệt với nhà Nguyễn của Nguyễn Ánh (vì cùng họ Nguyễn). Ngoài ra, \"Tây Sơn\" cũng chỉ các lãnh tụ và quân đội khởi nghĩa xuất thân từ ấp Tây Sơn; cũng được dùng làm tên cuộc chiến của Tây Sơn.\nNgười nắm quyền đầu tiên của nhà Tây Sơn là Nguyễn Nhạc, người anh cả, lên ngôi năm 1778. Tới năm 1788, Nguyễn Nhạc nhường ngôi cho em là Nguyễn Huệ, chính là Quang Trung hoàng đế.\nMột trong những công tích lớn nhất của nhà Tây Sơn trong lịch sử dân tộc là đã tiến đến rất gần công cuộc thống nhất và mở rộng lãnh thổ đất nước sau hàng trăm năm Việt Nam bị chia cắt bởi các cuộc tranh giành quyền lực giữa các thế lực lớn Mạc –Trịnh – Nguyễn kể từ khi nhà Lê sơ (1428–1527) bị sụp đổ, đồng thời triều đại này đã 2 lần đánh bại quân xâm lược ngoại quốc (quân Xiêm La và quân nhà Thanh) bằng những chiến dịch quân sự thần tốc. Tuy nhiên, năm 1792, vua Quang Trung (Nguyễn Huệ) đột ngột qua đời khi còn khá trẻ, người kế vị là Quang Toản còn quá nhỏ (9 tuổi) đã khiến nhà Tây Sơn không có lãnh đạo đủ năng lực, ưu thế dần chuyển sang Nguyễn Ánh, một hậu duệ của dòng họ Chúa Nguyễn nắm quyền trên đất Đàng Trong trước kia.\n"
  },
  {
    "kingdom": "Quân chủ chuyên chế",
    "capital": "Phú Xuân (nay là Huế) 16°28′B 107°36′Đ﻿ / ﻿16,467°B 107,6°Đ﻿ / 16.467; 107.600",
    "id": 44,
    "name": "Nhà Nguyễn",
    "description": "Nhà Nguyễn (chữ Nôm: 茹阮, chữ Hán: 阮朝; Hán-Việt: Nguyễn triều) là triều đại quân chủ cuối cùng trong lịch sử Việt Nam. Nhà Nguyễn được thành lập sau khi Nguyễn Ánh (Gia Long) lên ngôi hoàng đế năm 1802 và kết thúc khi Bảo Đại thoái vị vào năm 1945, tổng cộng là 143 năm. Triều Nguyễn là một triều đại đánh dấu nhiều thăng trầm trong lịch sử Việt Nam, đặc biệt là cuộc xâm lược của người Pháp giữa thế kỷ 19.\nTừ năm 1802–1884, các vua nhà Nguyễn nắm toàn quyền quản lý đất nước, trải qua 4 đời vua: Gia Long, Minh Mạng, Thiệu Trị, Tự Đức.[9] Gia Long và sau đó là Minh Mạng đã cố gắng xây dựng Việt Nam trên cơ sở nền tảng Nho giáo. Trong thời kỳ này, nội bộ đất nước không ổn định, triều Nguyễn ít được lòng dân, chỉ trong 60 năm đã xảy ra hơn 400 cuộc nổi dậy của người dân.[10] Gia Long tăng thuế khóa và lao dịch quá nặng khiến người dân bất bình, đến thời Minh Mạng thì lại diễn ra nhiều cuộc chiến tranh giành lãnh thổ ở Campuchia nên đã khiến ngân khố cạn kiệt, đến thời Tự Đức thì mọi mặt của đất nước đều sút kém. Từ thập niên 1850, một nhóm trí thức Việt Nam, tiêu biểu là Nguyễn Trường Tộ, đã nhận ra sự trì trệ của đất nước và yêu cầu học hỏi phương Tây để phát triển công nghiệp – thương mại, cải cách quân sự – ngoại giao, nhưng họ chỉ là thiểu số, còn đa số quan chức triều Nguyễn và giới sĩ phu không ý thức được sự cần thiết của việc cải cách và mở cửa đất nước nên Tự Đức không quyết tâm thực hiện những đề xuất này.[11] Nước Đại Nam dần trở nên trì trệ, lạc hậu và đứng trước nguy cơ bị thực dân châu Âu xâm chiếm.\nTừ năm 1884–1945, Đại Nam bị Pháp xâm lược và đô hộ, kể từ khi quân Pháp đánh Đà Nẵng và kết thúc sau khi Hoàng đế Bảo Đại thoái vị. Tháng 8 năm 1858, Hải quân Pháp đổ bộ tấn công vào cảng Đà Nẵng và sau đó rút vào xâm chiếm Gia Định. Tháng 6 năm 1862, vua Tự Đức ký hiệp ước cắt nhượng ba tỉnh miền Đông cho Pháp. Năm 1867, Pháp chiếm nốt ba tỉnh miền Tây kế tiếp để tạo thành một lãnh thổ thuộc địa Cochinchine (Nam Kỳ). Sau khi củng cố vị trí vững chắc ở Nam Kỳ, từ năm 1873 đến năm 1886, Pháp xâm chiếm nốt những phần còn lại của Việt Nam qua những cuộc chiến ở Bắc Kỳ. Đến năm 1884 thì nhà Nguyễn chính thức công nhận quyền cai trị của Pháp trên toàn Việt Nam. Pháp có thực quyền cai trị, còn các vua nhà Nguyễn tuy vẫn giữ ngôi vua nhưng chỉ còn là bù nhìn, quân Pháp có thể tùy ý phế lập vua nhà Nguyễn sau đó. Giai đoạn này kết thúc khi Nhật đảo chính Pháp nhưng thua khối Đồng Minh do Mỹ dẫn đầu trong Thế chiến 2 rồi Bảo Đại tuyên bố thoái vị ngay sau đó vào ngày 30 tháng 8 năm 1945 sau khi Nhật Bản đầu hàng quân đội đồng minh.[11]\n"
  },
  {
    "id": 45,
    "name": "Pháp thuộc",
    "description": "Pháp thuộc là một giai đoạn trong lịch sử Việt Nam kéo dài 61 năm, bắt đầu từ 1884 khi Pháp ép triều đình Huế kí Hòa ước Giáp Thân cho đến 1945 khi Pháp mất quyền cai trị ở Đông Dương. Tuy nhiên, nhiều tài liệu khác cho rằng thời kỳ Pháp thuộc cần được tính từ năm 1867 (tức là kéo dài gần 80 năm), khi Nam Kỳ Lục tỉnh bị nhà Nguyễn cắt nhượng cho Pháp, trở thành lãnh thổ đầu tiên Pháp chiếm được trong quá trình Pháp xâm lược Đại Nam.\nTrong thời kỳ này, Pháp thôn tính Việt Nam, Campuchia và Lào. Mất chủ quyền, Việt Nam bị chia cắt thành 3 xứ riêng biệt với ba cơ cấu hành chính riêng: xứ thuộc địa Nam Kỳ và hai xứ bảo hộ Bắc và Trung Kỳ. Cao Miên (Campuchia), Ai Lao cũng chịu sự cai trị của Pháp, và nhượng địa Quảng Châu Loan tiếp theo bị gom vào Liên bang Đông Dương.\nTháng 9 năm 1945, Pháp đem quân trở lại Việt Nam. Tuy người Pháp đã thừa nhận Việt Nam là nước tự do trong Liên bang Đông Dương thuộc Liên hiệp Pháp nhưng chiến tranh Đông Dương vẫn bùng nổ và Pháp đã thất bại sau 9 năm chiến tranh. Pháp buộc phải công nhận nền độc lập của Việt Nam (cũng như Lào và Campuchia), chính thức chấm dứt thời kỳ Pháp thuộc, đồng thời kéo theo sự sụp đổ hệ thống thuộc địa của Pháp và các nước thực dân khác trên khắp thế giới vào thập niên 1950 – 1960.\n"
  },
  {
    "kingdom": "Quân chủ tuyệt đối",
    "capital": "Huế",
    "id": 46,
    "name": "Đế quốc Việt Nam",
    "description": "Đế quốc Việt Nam (chữ Hán: 越南帝國; tiếng Nhật: ベトナム帝国, chuyển tự Betonamu Teikoku, cựu tự thể: 越南帝國, chuyển tự Etsunan Teikoku, tiếng Pháp: Empire du Viêt Nam) là tên gọi chính thức của một Nhà nước Việt Nam tồn tại chỉ 5 tháng trong lịch sử Việt Nam (từ tháng 3 đến tháng 8 năm 1945) dưới sự kiểm soát và chi phối của Đế quốc Nhật Bản.\nSau khi Nhật đảo chính Pháp tại Đông Dương đêm ngày 9 tháng 3 năm 1945, Hoàng đế Bảo Đại tuyên bố Đế quốc Việt Nam độc lập với sự cộng tác với Đế quốc Nhật Bản.[1] Ngày 17 tháng 4, Nội các Đế quốc Việt Nam do Trần Trọng Kim làm Tổng trưởng (Thủ tướng) được thành lập. Tuy có nội các nhưng Đế quốc Việt Nam thực chất vẫn là nền quân chủ chuyên chế mà không phải là nền quân chủ lập hiến như ở Anh Quốc hay Hà Lan. Do Đế quốc Việt Nam không có Quốc hội, cũng không có Hiến pháp, mặt khác, Đế quốc Nhật Bản vẫn nắm quyền chi phối hoạt động của Đế quốc Việt Nam, ngay cả các Bộ trưởng của Đế quốc Việt Nam không thể làm được việc gì nếu không được cố vấn tối cao Nhật Bản đồng ý.[2]\nTheo một số tài liệu lịch sử, Đế quốc Việt Nam là chính quyền do Đế quốc Nhật Bản dựng lên và không có thực quyền.[3][4] Giới sử gia phương Tây xếp chung với các chính phủ bù nhìn khác do Nhật thành lập tại các nước bị họ chiếm đóng trong Thế chiến II như Mãn Châu Quốc, Chính phủ Uông Tinh Vệ, Mông Cương, Đệ nhị Cộng hòa Philippines,...[5] Tháng 8 năm 1945, khi Đế quốc Nhật Bản sắp bại trận, Bảo Đại đã gửi thư cho Tổng thống Mỹ, vua Anh, Thống chế Trung Hoa và Pháp đề nghị công nhận Đế quốc Việt Nam là chính phủ đại diện cho Việt Nam nhưng không được hồi âm. Cùng với sự bại trận của Nhật Bản trong Thế chiến II, theo Tuyên bố Cairo, tất cả các chính phủ này đều tự sụp đổ hoặc bị Đồng Minh giải thể trong năm 1945.[5] Vua Bảo Đại sau này cũng xác nhận rằng nước Việt Nam chỉ là vật hiến tặng của Đế quốc Pháp cho Đế quốc Nhật Bản và không có được độc lập thực sự.[6]\n"
  },
  {
    "id": 47,
    "name": "Chiến tranh Đông Dương",
    "description": "Chiến tranh Đông Dương, còn được gọi là Chiến tranh Đông Dương lần thứ nhất là một cuộc xung đột diễn ra tại ba nước Đông Dương bao gồm Việt Nam, Lào và Campuchia, giữa một bên là Quân đội Viễn chinh Pháp cùng các lực lượng đồng minh bản xứ bao gồm lực lượng của Quốc gia Việt Nam, Vương quốc Lào, Vương quốc Campuchia thuộc Liên hiệp Pháp, bên kia là lực lượng Việt Nam Dân chủ Cộng hòa (Việt Minh) cùng các lực lượng kháng chiến khác của Lào (Pathet Lào) và Campuchia (Khmer Đỏ). Cuộc chiến bắt đầu từ ngày 19 tháng 12 năm 1946 khi Hồ Chí Minh ra lệnh Toàn quốc kháng chiến và kết thúc ngày 20 tháng 7 năm 1954 khi Hiệp định Genéve được ký kết. Tuy nhiên xung đột thật sự đã nổ ra từ ngày 23 tháng 9 năm 1945 khi quân Pháp theo chân quân Anh tiến vào miền Nam Việt Nam để giải giáp quân Nhật.\nĐối với Việt Nam Dân chủ Cộng hòa, đây là giai đoạn đầu tiên trong \"Cuộc kháng chiến 30 năm\" của họ với mục tiêu giành độc lập cho Việt Nam (giai đoạn 2 là cuộc chiến với Hoa Kỳ). Cuộc chiến diễn ra trên khắp Việt Nam và lan ra cả các nước láng giềng Lào và Campuchia, nhưng chiến sự chính diễn ra chủ yếu tại miền Bắc Việt Nam. Sau 9 năm sa lầy và với thất bại tại Trận Điện Biên Phủ, Pháp buộc phải chấp nhận ký kết Hiệp định Genève công nhận nền độc lập và toàn vẹn lãnh thổ của Việt Nam.\nCuộc chiến tranh này ở Việt Nam còn được gọi là Kháng chiến chống Pháp, Kháng chiến 9 năm, 9 năm kháng chiến trường kỳ, Thời 9 năm, Hồi 9 năm. Các tài liệu nghiên cứu, sách báo ở nước ngoài phần lớn gọi là Chiến tranh Việt-Pháp hoặc Chiến tranh Đông Dương.\n"
  },
  {
    "id": 48,
    "name": "Lịch sử Việt Nam thời kỳ 1945–1975",
    "description": ""
  },
  {
    "kingdom": "Đơn nhất Marx–Lenin đơn đảng cộng hòa xã hội chủ nghĩa",
    "id": 49,
    "name": "Việt Nam Dân chủ Cộng hòa",
    "description": "Việt Nam Dân chủ Cộng hòa (VNDCCH) là một nhà nước ở Đông Nam Á được Chủ tịch Hồ Chí Minh tuyên bố thành lập vào ngày 2 tháng 9 năm 1945 với thủ đô là Hà Nội. Với Tổng tuyển cử năm 1946, Việt Nam Dân chủ Cộng hòa chính thức trở thành nhà nước có chủ quyền trên toàn bộ lãnh thổ Việt Nam[3][4], được Quốc hội Việt Nam khóa I thông qua mặc dù một số vùng lãnh thổ sau đó bị các lực lượng ngoại quốc và nhà nước khác quản lý về hành chính trên thực tế. Cuối Chiến tranh Đông Dương lần thứ nhất, lãnh thổ Việt Nam bị chia làm hai vùng tập kết quân sự tạm thời theo Hiệp định Genève. Theo Hiệp định Genève 1954, vùng lãnh thổ thuộc quản lý hành chính của Việt Nam Dân chủ Cộng hoà giáp với Trung Quốc ở phía bắc, Lào ở phía tây, và phía nam giáp với lãnh thổ quản lý bởi Quốc gia Việt Nam (tiền thân của Việt Nam Cộng hòa, sau đó được Cộng hòa Miền Nam Việt Nam tiếp quản). Cũng trong giai đoạn này, Việt Nam Dân chủ Cộng hòa cũng được gọi là miền Bắc Việt Nam (tiếng Anh: North Vietnam, nguyên văn \u0027Bắc Việt Nam\u0027) để chỉ vị trí địa lý của phần lãnh thổ Việt Nam được quản lý bởi nhà nước này theo Hiệp định Genève. Từ năm 1954–1976, Việt Nam Dân chủ Cộng hòa là nhà nước độc lập đi theo chế độ xã hội chủ nghĩa.\nTrong Chiến tranh thế giới thứ hai, Việt Nam từ chỗ là thuộc địa của Pháp đã trở thành Đế quốc Việt Nam thân Nhật Bản sau khi Pháp đầu hàng và trao toàn bộ Đông Dương cho Phát xít Nhật Bản vào tháng 3 năm 1945. Ngay sau khi Nhật Bản đầu hàng quân Đồng Minh, bao gồm cả Việt Minh ở Việt Nam và Cách mạng tháng 8 năm 1945 thành công, nước Việt Nam Dân chủ Cộng hòa được tuyên bố thành lập tại Hà Nội, chính quyền lâm thời được thiết lập trên toàn bộ đất nước. Chủ tịch Hồ Chí Minh, người lãnh đạo Việt Minh, trở thành người đứng đầu chính phủ mới và đã ngay lập tức tổ chức cuộc Tổng tuyển cử toàn quốc vào ngày 06/01/1946 để Việt Nam có chính phủ và nhà nước chính danh trên toàn quốc.[5] Ngay sau khi Pháp quay lại Việt Nam với sự hỗ trợ của Anh và Mỹ, thì Kháng chiến chống Pháp đã nổ ra vào năm 1946. Sau 9 năm chiến tranh, ngày 21 tháng 7 năm 1954, Việt Nam Dân chủ Cộng hòa giành thắng lợi, Hiệp định Genève được ký kết giữa các bên tham chiến, Việt Nam tạm thời bị chia làm 2 vùng tập kết tạm thời, lấy vĩ tuyến 17 làm ranh giới. Lực lượng quân sự của Việt Nam Dân chủ Cộng hòa tập kết về miền Bắc Việt Nam, trong khi đó, Quân đội Pháp và Quân đội Quốc gia Việt Nam (thuộc Liên hiệp Pháp) tập kết về miền Nam Việt Nam, quân Pháp sẽ rút hết khỏi Việt Nam sau 2 năm.\nHiệp định Genève xác định cuộc tổng tuyển cử thống nhất lãnh thổ Việt Nam sẽ diễn ra vào năm 1956. Người Pháp chấp nhận đề nghị của Thủ tướng Phạm Văn Đồng, trưởng phái đoàn đàm phán Việt Nam Dân chủ Cộng hòa[6], là cuộc tổng tuyển cử thống nhất sẽ được đặt dưới sự giám sát của các ủy ban tại chỗ[7]. Hoa Kỳ không công nhận Hiệp định Genève, đồng thời thực hiện \"Kế hoạch can thiệp\" nhằm trợ giúp cho Quốc gia Việt Nam (sau đó là Việt Nam Cộng hòa) từ chối thi hành tuyển cử[8]. Năm 1955, cuộc trưng cầu dân ý bị gian lận đã phế truất Quốc trưởng Bảo Đại (nguyên là hoàng đế nhà Nguyễn), sau đó chính quyền Việt Nam Cộng hòa được thành lập tại miền Nam Việt Nam do Ngô Đình Diệm làm Tổng thống.[9] Đến hạn năm 1956, Ngô Đình Diệm tuyên bố từ chối thi hành tuyển cử, và cuộc tổng tuyển cử thống nhất Việt Nam đã không thể diễn ra, khiến lãnh thổ Việt Nam bị chia cắt về mặt nhà nước.[10] Thậm chí, phía Việt Nam Dân chủ Cộng hòa còn cho rằng hành động của Ngô Đình Diệm còn nhằm biến miền Nam thành thuộc địa kiểu mới và căn cứ quân sự của Mỹ.[11]\n"
  },
  {
    "kingdom": "Chính phủ lâm thời (do chưa có Quốc hội và Hiến pháp), thành viên trong Khối Liên hiệp Pháp",
    "capital": "Sài Gòn 10°48′B 106°39′Đ﻿ / ﻿10,8°B 106,65°Đ﻿ / 10.800; 106.650",
    "id": 50,
    "name": "Quốc gia Việt Nam",
    "description": "Quốc gia Việt Nam (tiếng Pháp: État du Viêt Nam) là một chính phủ thuộc Liên bang Đông Dương thuộc Liên hiệp Pháp, tuyên bố chủ quyền toàn bộ lãnh thổ Việt Nam, tồn tại trong giai đoạn từ giữa năm 1948 đến 1955. Thủ đô đặt tại Sài Gòn, nhưng quốc trưởng Bảo Đại lại sống và làm việc tại Đà Lạt.\nQuốc gia Việt Nam được thành lập theo một thỏa thuận năm 1949 giữa Bảo Đại (cựu hoàng của nhà Nguyễn) và Tổng thống Pháp. Về mặt pháp lý, có quan điểm cho rằng bản thỏa thuận này bị xem là bất hợp pháp, do Bảo Đại đã thoái vị từ ngày 25/8/1945 và chỉ còn là một công dân bình thường nên ông ta không có tư cách pháp lý để thay mặt đất nước ký thỏa thuận với Pháp (Trong khi đó Chính phủ Việt Nam Dân chủ Cộng hòa do Hồ Chí Minh làm Chủ tịch đang tiến hành kháng chiến chống Pháp). Việc thành lập Quốc gia Việt Nam bị chính quyền Việt Nam Dân chủ Cộng hòa coi như một chiêu bài của thực dân Pháp, nhằm thành lập chính phủ bù nhìn để hợp thức hóa việc xâm lược Việt Nam.[2] Vì việc thỏa hiệp với Pháp, Bảo Đại đã bị tòa án Việt Nam Dân chủ Cộng hòa kết án phản quốc từ năm 1948.[3]\nVề hình thức, quốc gia này gần như là một nước quân chủ chuyên chế do chưa có Hiến pháp và Quốc hội với Quốc trưởng là cựu hoàng Bảo Đại (tương tự nhà nước Lào và Campuchia được Pháp công nhận ngay sau đó). Trong thực tế thì quyền cai trị vẫn thuộc về Pháp, với Cao ủy Pháp kiểm soát tài chính, thương mại, quân sự và chính sách đối ngoại của Quốc gia Việt Nam.[4]\n"
  },
  {
    "kingdom": "Cộng hòa tổng thống (1955–1956) Cộng hòa lập hiến đơn nhất tổng thống chế (1956–1963) Độc tài quân sự (1963–1967) Cộng hòa tổng thống đa đảng đơn nhất (1967–1969) Cộng hòa lập hiến độc đảng cầm quyền tổng thống chế (1969–1975)",
    "capital": "Sài Gòn 10°48′B 106°39′Đ﻿ / ﻿10,8°B 106,65°Đ﻿ / 10.800; 106.650",
    "id": 51,
    "name": "Việt Nam Cộng hòa",
    "description": "Việt Nam Cộng hòa (VNCH; tiếng Anh: Republic of Vietnam; tiếng Pháp: République du Viêt Nam, viết tắt RVN) là một nhà nước đã từng tồn tại từ năm 1955 đến năm 1975.\nTrong các tài liệu quốc tế, chính phủ này còn được gọi là South Vietnam (n.đ. \u0027Nam Việt Nam\u0027 hoặc \u0027miền Nam Việt Nam\u0027) để chỉ phạm vi địa lý kể từ khi Hiệp định Genève được ký kết và Việt Nam bị chia cắt thành hai vùng tập kết quân sự tạm thời. Với sự hậu thuẫn của Hoa Kỳ, Việt Nam Cộng hòa bác bỏ việc thực hiện tổng tuyển cử thống nhất Việt Nam vào năm 1956 theo Hiệp định Genève với lý do họ không ký hiệp định này. Chính phủ Việt Nam Cộng hòa đối chọi với Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam thành lập năm 1969 do Mặt trận Dân tộc Giải phóng miền Nam Việt Nam lãnh đạo.\nNguồn gốc của Việt Nam Cộng hòa bắt nguồn từ Chiến tranh Đông Dương. Sau Thế chiến II, phong trào Việt Minh do Hồ Chí Minh lãnh đạo đã tuyên bố thành lập nước Việt Nam Dân chủ Cộng hòa vào ngày 2 tháng 9 năm 1945. Cuối năm 1945, thực dân Pháp quay trở lại xâm chiếm Việt Nam. Năm 1949, bằng một hiệp định với thực dân Pháp, một nhóm chính trị gia chống Cộng đã thành lập Quốc gia Việt Nam do Bảo Đại làm Quốc trưởng. Sau khi Pháp thất bại và rút quân về nước năm 1954, Hoa Kỳ thế chỗ Pháp, tiếp tục hậu thuẫn chế độ Quốc gia Việt Nam nhằm ngăn chặn việc Việt Nam Dân chủ Cộng hòa tiếp quản toàn bộ đất nước. Thủ tướng Ngô Đình Diệm đã phế truất Bảo Đại vào năm 1955 sau một cuộc trưng cầu dân ý. Quốc gia Việt Nam được đổi tên thành Việt Nam Cộng hòa vào ngày 26 tháng 10 năm 1955, với Ngô Đình Diệm là tổng thống đầu tiên.[1] Chính phủ này lập tức được Hoa Kỳ công nhận và lần lượt có quan hệ ngoại giao với 77 quốc gia. Năm 1957, Việt Nam Cộng hòa đệ đơn xin gia nhập Liên Hợp Quốc nhưng đề nghị này bị Liên Xô phủ quyết.[2][3] Sau những hỗn loạn nội bộ ngày càng gia tăng, Ngô Đình Diệm bị ám sát trong cuộc đảo chính năm 1963 do tướng Dương Văn Minh cầm đầu và được Hoa Kỳ hậu thuẫn. Sau đó, một loạt chính quyền quân sự được thành lập nhưng liên tục sụp đổ do các cuộc đảo chính lẫn nhau. Tướng Nguyễn Văn Thiệu sau đó nắm quyền trong giai đoạn 1967–1975 sau cuộc tuyển cử tổng thống.\n"
  },
  {
    "kingdom": "Chính phủ Cách mạng lâm thời",
    "capital": "Thị xã Đông Hà (1973–1975) Sài Gòn – Gia Định (1975–1976)",
    "id": 52,
    "name": "Cộng hòa Miền Nam Việt Nam",
    "description": "Cộng hòa miền Nam Việt Nam là một chính thể tại miền Nam Việt Nam, được thành lập bởi Đại hội Quốc dân miền Nam Việt Nam mà nòng cốt là lực lượng Mặt trận Dân tộc Giải phóng miền Nam Việt Nam, Liên minh các Lực lượng Dân tộc, Dân chủ và Hòa bình Việt Nam thành lập ở miền Nam Việt Nam với mục đích quản lý các vùng đất do phía Mặt trận Dân tộc Giải phóng miền Nam kiểm soát tại miền Nam Việt Nam. Đây là nhà nước lâm thời được lập ra nhằm để tăng tính hợp pháp và chính danh của các vùng mà Mặt trận Dân tộc Giải phóng Miền Nam Việt Nam kiểm soát.\nTheo Hiệp định Paris, thì Cộng hòa miền Nam Việt Nam là một trong hai chính thể tồn tại ở miền Nam Việt Nam, và là một trong ba chính thể trên lãnh thổ Việt Nam. Cộng hòa Miền Nam Việt Nam được một số các quốc gia công nhận và có quan hệ ngoại giao (tính đến 24/1/1976 thì chính thể này có tổng cộng 90 nước công nhận và thiết lập quan hệ ngoại giao, Kuwait là nước cuối cùng thiết lập quan hệ ngoại giao với Nhà nước này 24/1/1976 trước khi Việt Nam tái thống nhất hòa bình 2/7/1976)[cần dẫn nguồn]. Chính thể này tham gia ký Hiệp định Paris 1973 với tư cách là một bên tham chiến. Chính phủ này tiếp quản các lãnh thổ thuộc kiểm soát của Việt Nam Cộng hòa sau sự kiện 30 tháng 4 năm 1975. Ngày 2 tháng 7 năm 1976, Cộng hòa Miền Nam Việt Nam và Việt Nam Dân chủ Cộng hòa hợp nhất thành Cộng hòa xã hội chủ nghĩa Việt Nam dưới sự lãnh đạo của Đảng Cộng sản Việt Nam.\n"
  },
  {
    "kingdom": "Cộng hòa xã hội chủ nghĩa một đảng đơn nhất theo chủ nghĩa Marx-Lenin",
    "capital": "Hà Nội 21°2′B 105°51′Đ﻿ / ﻿21,033°B 105,85°Đ﻿ / 21.033; 105.850",
    "id": 53,
    "name": "Việt Nam",
    "description": "Việt Nam, quốc hiệu là Cộng hòa xã hội chủ nghĩa Việt Nam,[12] là một quốc gia nằm ở cực Đông của bán đảo Đông Dương thuộc khu vực Đông Nam Á, giáp với Lào, Campuchia, Trung Quốc, biển Đông và vịnh Thái Lan.\nLãnh thổ Việt Nam xuất hiện con người sinh sống từ thời đại đồ đá cũ, khởi đầu với các nhà nước Văn Lang, Âu Lạc. Âu Lạc bị nhà Triệu ở phương Bắc thôn tính vào đầu thế kỷ thứ 2 TCN sau đó là thời kỳ Bắc thuộc kéo dài hơn một thiên niên kỷ. Chế độ quân chủ độc lập được tái lập sau chiến thắng của Ngô Quyền trước nhà Nam Hán. Sự kiện này mở đường cho các triều đại độc lập kế tục và sau đó nhiều lần chiến thắng trước các cuộc chiến tranh xâm lược từ phương Bắc cũng như dần mở rộng về phía nam. Thời kỳ Bắc thuộc cuối cùng kết thúc sau chiến thắng trước nhà Minh của nghĩa quân Lam Sơn.\nĐến thời kỳ cận đại, Việt Nam lần lượt trải qua các giai đoạn Pháp thuộc và Nhật thuộc. Sau khi đánh bại và buộc Nhật Bản đầu hàng, Đồng Minh tạo điều kiện cho Pháp thu hồi Liên bang Đông Dương. Kết thúc Thế chiến II, Việt Nam chịu sự can thiệp trên danh nghĩa giải giáp quân đội Nhật của các nước Đồng Minh bao gồm Anh, Pháp (miền Nam), Trung Hoa Dân Quốc (miền Bắc). Nhà nước Việt Nam Dân chủ Cộng hòa do Mặt trận Việt Minh lãnh đạo ra đời khi Hồ Chí Minh tuyên bố độc lập vào ngày 2 tháng 9 năm 1945 sau thành công của Cách mạng Tháng Tám và chiến thắng Liên hiệp Pháp cùng Quốc gia Việt Nam do Pháp hậu thuẫn trong chiến tranh Đông Dương lần thứ nhất. Sự kiện này dẫn tới việc Hiệp định Genève (1954) được ký kết và Việt Nam bị chia cắt thành hai vùng tập kết quân sự, lấy ranh giới là vĩ tuyến 17. Việt Nam Dân chủ Cộng hoà kiểm soát phần phía bắc còn phía nam do Việt Nam Cộng hoà (nhà nước kế tục Quốc gia Việt Nam) kiểm soát và được Hoa Kỳ ủng hộ. Xung đột về vấn đề thống nhất lãnh thổ đã dẫn tới chiến tranh Việt Nam với sự can thiệp của nhiều nước và kết thúc với chiến thắng của Việt Nam Dân chủ Cộng hòa, Mặt trận Dân tộc Giải phóng miền Nam Việt Nam cùng sự sụp đổ của Việt Nam Cộng hoà vào năm 1975. Chủ quyền phần phía Nam được chính quyền Cộng hoà miền Nam Việt Nam (do Mặt trận Dân tộc Giải phóng miền Nam Việt Nam thành lập) giành quyền kiểm soát. Năm 1976, Việt Nam Dân chủ Cộng hòa và Cộng hoà miền Nam Việt Nam thống nhất thành Cộng hòa Xã hội chủ nghĩa Việt Nam.\n"
  },
  {
    "id": 54,
    "name": "Lịch sử Việt Nam thời kỳ từ 1976",
    "description": ""
  },
  {
    "id": 55,
    "name": "Vua Việt Nam",
    "description": "Vua nước Việt (chữ Nôm:𤤰渃越) là vị quân chủ nước Việt Nam độc lập tự chủ từ thời dựng nước đến Cách mạng Tháng Tám năm 1945, tùy thuộc vào hoàn cảnh lịch sử mà vua Việt Nam có thể mang tước hiệu khác nhau. Ở trong nước, tước hiệu tự xưng cao nhất là Hoàng đế và thấp hơn là Quốc vương hoặc Quận vương\nTrong huyền sử, khái niệm vua Việt Nam đã thấy ghi chép từ thời Hồng Bàng (các Hùng Vương với nước Văn Lang), nhưng còn nhiều điểm nghi vấn mơ hồ chưa thể khẳng định rõ ràng.[a] Sau đó, An Dương vương cướp ngôi họ Hùng lập ra nhà Thục với nước Âu Lạc rồi họ Triệu (Triệu Đà) lấy nước của nhà Thục. Thế nhưng, Hồng Bàng thị là dòng dõi Thần Nông thị,[1] Thục Phán An Dương vương là hậu duệ Khai Minh thị[1] còn Triệu Đà cũng là người Hán...[2] Như vậy, những triều đại sơ khai đều có sự nghi vấn gây tranh cãi. Trong ngàn năm Bắc thuộc từng trỗi dậy những chính quyền nhưng thời gian tồn tại chưa được bao lâu đã bị dẹp yên, sự nghiệp chưa ổn định lâu dài nên chưa thể cấu thành triều đại. Từ khi họ Khúc giành lấy quyền tự chủ cho đến hết loạn 12 sứ quân, danh nghĩa Việt Nam vẫn chỉ là một phiên trấn của Trung Quốc với cái tên Tĩnh Hải quân, các nhà lãnh đạo Việt Nam thời tự chủ chỉ ở mức Tiết độ sứ cả trong nước và ngoại giao, đến lúc Ngô Quyền đánh đuổi quân Nam Hán mới tự xưng Vương. Bắt đầu từ đấy, vua Việt Nam mới chính thức được xác định, tuy nhiên, nhà Ngô vẫn chưa đặt quốc hiệu. Bấy giờ bên Trung Quốc cũng đang loạn to, chính quyền trung ương còn mải lo đánh dẹp nên chưa thể nhòm ngó xuống mạn cực nam, chỉ có nước Nam Hán kế cận thỉnh thoảng xung đột mà thôi. Đến thời nhà Đinh, đối với thần dân trong nước, các vua người Việt đã xưng hoàng đế và đặt quốc hiệu là Đại Cồ Việt, gặp lúc nhà Tống cũng mới chấm dứt cục diện Ngũ đại Thập quốc nên sai sứ sang sắc phong vua Đinh làm Giao Chỉ quận vương, từ đó nền quân chủ Việt Nam mới được xác lập.[b]\nSau các cuộc tấn công thất bại của nhà Tống, Trung Quốc đã phải công nhận quyền lực của người Việt ở Thăng Long. Nước Việt được xem như một dạng chư hầu đặc biệt mà Trung Quốc không thể sáp nhập bằng vũ lực; nhưng ngược lại, người Việt cũng phải công nhận Trung Quốc là một nước lớn, về phương diện ngoại giao phải chịu lép nhường thần quyền con trời, mạng trời cao hơn cho vua Trung Quốc, tuy vua Việt vẫn có quyền xưng là con trời và vâng mệnh trời cai trị dân đối với dân nước Việt. Vua Việt Nam tự ví mình với Mặt Trời như vua Trung Quốc. Từ đây, mô hình chính trị Trung Hoa đã được Việt hóa và phát triển để khẳng định ngai vua ở Thăng Long là ngai vàng của Hoàng đế nước Nam trị vì \"Đế quốc phương Nam\" theo mệnh trời. Hệ thống triều đình của các vua nước Việt cũng tương tự các triều đình của vua chúa Trung Quốc, các nghi thức và danh phận của các vị quan cũng tương tự như quan lại Trung Quốc.\n"
  },
  {
    "id": 56,
    "name": "Nguyên thủ Việt Nam",
    "description": ""
  },
  {
    "id": 57,
    "name": "Quốc gia cổ trong lịch sử Việt Nam",
    "description": "Trên lãnh thổ của nước Việt Nam hiện đại, bên cạnh Văn Lang là quốc gia tiền thân của Việt Nam, đã từng có mặt các vương quốc cổ và tiểu quốc cổ khác đã bị diệt vong:\n"
  },
  {
    "id": 58,
    "name": "Niên biểu lịch sử Việt Nam",
    "description": "Niên biểu lịch sử Việt Nam là hệ thống các sự kiện lịch sử Việt Nam nổi bật theo thời gian từ các thời tiền sử, huyền sử, cổ đại, trung đại, cận đại cho tới lịch sử hiện đại ngày nay.\n25.000 TCN–7.000 TCN Văn hóa Soi Nhụ\n23.000 TCN Văn hóa Ngườm\n"
  }
]