[
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 83,
  "name": "Hồng Bàng \u0026 Văn Lang",
  "description": "Thời kỳ Hồng Bàng theo truyền thuyết và dã sử cho rằng bắt đầu từ năm 2879 TCN, là niên đại của Kinh Dương Vương, với quốc hiệu Xích Quỷ. Lãnh thổ của quốc gia dưới thời Kinh Dương vương rộng lớn, phía bắc tới sông Dương Tử (cả vùng hồ Động Đình), phía nam tới nước Hồ Tôn (Chiêm Thành), phía đông là Đông Hải (một phần của Thái Bình Dương), phía tây là Ba Thục (Tứ Xuyên, Trung Hoa ngày nay). Về sau người Việt chỉ thấy có ở miền Bắc Việt Nam ngày nay, có thể một phần do sự lấn áp của các tộc người Hoa Hạ từ phương Bắc. Có ít nhất 18 đời Hùng Vương cai trị trong thời đại Hồng Bàng, cho đến năm 258 TCN. Các thông tin về các đời vua Hùng dựa nhiều trên các truyền thuyết. Cũng có nhiều bằng chứng khảo cổ học như trống đồng Đông Sơn được tìm thấy ở miền bắc Việt Nam có cùng niên đại với thời kỳ Hồng Bàng, thể hiện một nền văn hóa đồ đồng rất phát triển (văn hoá Đông Sơn)."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 84,
  "name": "Âu Lạc \u0026 Nam Việt",
  "description": "Theo hai bộ sử ký Đại Việt sử ký toàn thư (viết ở thế kỷ 15) và Đại Việt sử lược (viết ở thế kỷ 13), thì nhà nước Âu Lạc được Thục Phán (thủ lĩnh bộ tộc Âu Việt) thành lập vào năm 258 TCN sau khi đánh bại vị vua Hùng cuối cùng của nước Văn Lang, ông lên ngôi và lấy niên hiệu là An Dương Vương. An Dương Vương sát nhập lãnh thổ của Văn Lang và lãnh thổ của bộ tộc mình (Âu Việt) và hình thành nên một nhà nước mới là Âu Lạc (kết hợp giữa người Âu Việt và người Lạc Việt) Lãnh thổ Âu Lạc gồm lãnh cũ của bộ tộc Âu Việt ở phía bắc, mà ngày nay là một phần phía nam tỉnh Quảng Tây (Trung Quốc) và lãnh thổ của Văn Lang ở miền bắc Việt Nam. Âu Lạc có ranh giới phía bắc là sông Tả Giang (Quảng Tây) đến phía nam là dãy núi Hoành Sơn ở Hà Tĩnh hiện nay."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 85,
  "name": "Bắc thuộc lần I",
  "description": "Thời kỳ Bắc thuộc lần thứ nhất trong lịch sử Việt Nam kéo dài từ năm 218 TCN hoặc 179 TCN hoặc 111 TCN đến năm 39, dưới sự cai trị của phong kiến Trung Quốc."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 86,
  "name": "Trưng Nữ Vương",
  "description": "Hai Bà Trưng (40 - 43) là thời kỳ xen giữa Bắc thuộc lần 1 và Bắc thuộc lần 2 trong lịch sử Việt Nam. Đây là tên gọi chung của hai chị em Trưng Trắc và Trưng Nhị, là anh hùng dân tộc của người Việt, những thủ lĩnh khởi binh chống lại nhà Đông Hán của Trung Quốc, lập ra một quốc gia với kinh đô tại Mê Linh và tự phong là Nữ vương."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 87,
  "name": "Bắc thuộc lần II",
  "description": "Thời kỳ Bắc thuộc lần thứ hai trong lịch sử Việt Nam kéo dài từ năm 43 đến năm 543. Thời kỳ này bắt đầu khi Mã Viện theo lệnh Hán Quang Vũ Đế nhà Đông Hán đánh chiếm lại bộ Giao Chỉ từ tay Trưng Vương, kéo dài đến khi Lý Bí khởi binh đánh đuổi thứ sử[1] nhà Lương là Tiêu Tư năm 542 rồi lập ra nước Vạn Xuân năm 544. Thời kỳ Bắc thuộc lần thứ 2 kéo dài khoảng 500 năm."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 88,
  "name": "Nhà Lý \u0026 Nhà Triệu",
  "description": "Nhà Tiền Lý (544-602) là một triều đại trong lịch sử Việt Nam, gắn liền với quốc hiệu Vạn Xuân. Nhà Tiền Lý kéo dài 58 năm, tổng cộng 3 đời vua, trong đó có 2 vua họ Lý và 1 vua họ Triệu cũng được tính gộp vào nhà Tiền Lý, tương tự như Dương Tam Kha trong nhà Ngô sau đó."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 89,
  "name": "Bắc thuộc lần III",
  "description": "Thời kỳ Bắc thuộc lần thứ ba trong lịch sử Việt Nam kéo dài từ năm 602 đến năm 905. Thời kỳ này bắt đầu khi Tùy Văn Đế sai Lưu Phương đánh chiếm nước Vạn Xuân, bức hàng Hậu Lý Nam Đế, kéo dài cho đến khi Khúc Thừa Dụ tiến vào Đại La, giành quyền cai quản toàn bộ Tĩnh Hải quân năm 905 - thời Đường Ai Đế, ông vua bù nhìn trong tay quyền thần Chu Ôn."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 90,
  "name": "Thời kỳ xây nền tự chủ",
  "description": "Tự chủ là thời kỳ đầu khôi phục lại nền độc lập của Việt Nam đầu thế kỷ 10 sau hơn 1000 năm Bắc thuộc. Thời kỳ này người Việt đã tự cai trị lãnh thổ nhưng chưa xưng làm vua, và chưa đặt quốc hiệu. Bề ngoài, Việt Nam vẫn là một phần lãnh thổ của \"thiên triều\" phương bắc ở trung nguyên với tên gọi \"Tĩnh Hải quân\" và người đứng đầu chỉ nối tiếp nhau làm chức Tiết độ sứ như một quan cai trị của Trung Quốc trước đây. Thời kỳ tự chủ bắt đầu từ khi họ Khúc nổi dậy nắm quyền thay các Tiết độ sứ người Trung Quốc (905) và kết thúc khi Ngô Quyền tiêu diệt Kiều Công Tiễn và đánh thắng quân Nam Hán, lập ra nhà Ngô (938)."
},
{
  "kingdom": "Quân chủ",
  "capital": "Cổ Loa",
  "id": 91,
  "name": "Nhà Ngô"
},
{
  "kingdom": "Quân chủ",
  "capital": "Hoa Lư",
  "id": 92,
  "name": "Nhà Đinh"
},
{
  "kingdom": "Quân chủ",
  "capital": "Hoa Lư",
  "id": 93,
  "name": "Nhà Tiền Lê"
},
{
  "kingdom": "Quân chủ",
  "capital": "Hoa Lư (1009 - 1010) Thăng Long (1010 - 1225)",
  "id": 94,
  "name": "Nhà Lý"
},
{
  "kingdom": "Quân chủ chuyên chế",
  "capital": "Thăng Long Thiên Trường[1] Thanh Hoá (tạm thời)",
  "id": 95,
  "name": "Nhà Trần"
},
{
  "kingdom": "Quân chủ",
  "capital": "Tây Đô 20°4′B 105°36′Đ﻿ / ﻿20,067°B 105,6°Đ﻿ / 20.067; 105.600",
  "id": 96,
  "name": "Nhà Hồ"
},
{
  "kingdom": "Quân chủ chuyên chế",
  "capital": "Mô Độ (1407 - 1409) Bình Than (1409 - 1414)",
  "id": 97,
  "name": "Nhà Hậu Trần"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 98,
  "name": "Bắc thuộc lần IV",
  "description": "Sau khi chiếm được Đại Việt, quân Minh chia nước ta thành quận huyện để cai trị. Chúng bắt nhân dân ta làm tôi tớ, thuế má lao dịch nặng nề, cuộc sống vô cùng cực khổ. Ngày Mậu Thân, tháng Giêng năm Mậu Tuất (7/2/1418), Lê Lợi phất cờ khởi nghĩa ở hương Lam Sơn, huyện Lương Giang, trấn Thanh Hoá. Có quân sư Nguyễn Trãi dâng sách Bình Ngô nhằm thu phục lòng người, cháu nội của quan Tư đồ Trần Nguyên Đán là Trần Nguyên Hãn và nhiều nhân tài, hào kiệt các nơi tham gia. Ngày 3/1/1428, nghĩa quân hoàn toàn thắng lợi, Lê Lợi lên ngôi Hoàng đế, lập nên triều đại nhà Lê. Sử gọi là Hậu Lê để phân biệt với Tiền Lê 980-1009 do Lê Hoàn sáng lập."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 99,
  "name": "Nhà Hậu Lê"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 100,
  "name": "Nam Bắc Triều",
  "description": "Mạc Đăng Dung, sau khi dẹp được các bè phái trong cung đình, đã ép vua Lê Cung Hoàng nhà Hậu Lê nhường ngôi tháng 6 năm 1527 và chấm dứt khi vua Mạc Mậu Hợp bị quân đội Lê-Trịnh do Trịnh Tùng chỉ huy đánh bại vào cuối năm 1592– tổng cộng thời gian tồn tại chính thức của triều đại là gần 66 năm. Tuy nhiên, giai đoạn sau đó hậu duệ nhà Mạc như Mạc Kính Cung, Mạc Kính Khoan, Mạc Kính Vũ vẫn còn tiếp tục chống lại nhà Hậu Lê thời kỳ trung hưng đến tận năm 1677 tại khu vực Cao Bằng. Thời kỳ 1533-1592 trong lịch sử Việt Nam còn được gọi là thời kỳ Nam-Bắc triều, do chính quyền nhà Mạc chỉ thực sự có quyền lực từ địa phận Ninh Bình ngày nay trở ra, còn từ Thanh Hóa trở vào là thế lực lấy danh nghĩa gây dựng lại nhà Lê từ năm 1533."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 101,
  "name": "Trịnh Nguyễn Phân Tranh",
  "description": "Trịnh-Nguyễn phân tranh là thời kỳ phân chia giữa chế độ \"vua Lê chúa Trịnh\" ở phía Bắc sông Gianh (sử gọi là Đàng Ngoài) và chúa Nguyễn cai trị ở miền Nam (Đàng Trong), mở đầu khi Trịnh Tráng đem quân đánh Nguyễn Phúc Nguyên năm 1627 và kết thúc vào cuối thế kỷ 18 khi nhà Tây Sơn đánh đổ cả chúa Nguyễn lẫn chúa Trịnh. Ban đầu, cả thế lực họ Trịnh và họ Nguyễn đều mang khẩu hiệu \"phù Lê diệt Mạc\" để lấy lòng thiên hạ và thề trung thành với triều Hậu Lê. Sau khi nhà Mạc đã bị đánh đổ, trên danh nghĩa, cả Chúa Trịnh và Chúa Nguyễn đều là bề tôi của nhà Hậu Lê, cả Đàng Trong lẫn Đàng Ngoài đều là lãnh thổ của nhà Lê. Nhưng trên thực tế thì khác, cả hai đều tạo thế lực cát cứ cho riêng mình, vua nhà Hậu Lê đã không còn thực quyền nên không chặn được sự phân tranh giữa hai họ Trịnh - Nguyễn. Nước Đại Việt trong giai đoạn này bị chia cách hơn 150 năm."
},
{
  "kingdom": "Quân chủ chuyên chế",
  "capital": "Quy Nhơn (1778-1788) Phú Xuân (1788-1802) Phượng Hoàng Trung Đô (1788-1802)",
  "id": 102,
  "name": "Nhà Tây Sơn"
},
{
  "kingdom": "Quân chủ chuyên chế",
  "capital": "Phú Xuân (nay là Huế) 16°28′B 107°36′Đ﻿ / ﻿16,467°B 107,6°Đ﻿ / 16.467; 107.600",
  "id": 103,
  "name": "Nhà Nguyễn"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 104,
  "name": "Pháp Thuộc",
  "description": "Pháp thuộc là một giai đoạn trong lịch sử Việt Nam kéo dài 61 năm, bắt đầu từ 1884 khi Pháp ép triều đình Huế chấp nhận sự bảo hộ của Pháp cho đến 1945 khi Pháp mất quyền cai trị ở Đông Dương. Tuy nhiên, nhiều tài liệu khác cho rằng thời kỳ Pháp thuộc cần được tính từ năm 1867 (tức là kéo dài gần 80 năm), khi Nam Kỳ Lục tỉnh bị nhà Nguyễn cắt nhượng cho Pháp, trở thành lãnh thổ đầu tiên Pháp chiếm được trong quá trình Pháp xâm lược Đại Nam. Trong thời kỳ này Việt Nam bị chia cắt thành 3 xứ riêng biệt với ba cơ cấu hành chính riêng: xứ thuộc địa Nam Kỳ và hai xứ bảo hộ Bắc và Trung Kỳ. Cao Miên (Campuchia), Ai Lao cũng chịu sự cai trị của Pháp, và nhượng địa Quảng Châu Loan tiếp theo bị gom vào Liên bang Đông Dương. Tháng 9 năm 1945, Pháp đem quân trở lại tấn công Việt Nam, nhưng người Việt Nam phản kháng quyết liệt và Pháp đã bị thất bại sau 9 năm chiến tranh. Pháp buộc phải công nhận nền độc lập của Việt Nam (cũng như Lào và Campuchia), chính thức chấm dứt thời kỳ Pháp thuộc, đồng thời kéo theo sự sụp đổ hệ thống thuộc địa của Pháp và các nước thực dân khác trên khắp thế giới vào thập niên 1950 - 1960."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 105,
  "name": "Việt Nam Dân Chủ Cộng Hoà",
  "description": "Ngày 3/2/1930, Đảng cộng sản Đông Dương ra đời. Dưới sự lãnh đạo của lãnh tụ Nguyễn Ái Quốc, dân tộc ta đã khởi nghĩa làm cuộc Cách mạng tháng Tám (19-8-1945) thành công, đánh đổ đế quốc Pháp và phát xít Nhật. Ngày 2/9/1945, Chủ tịch Hồ Chí Minh đọc Tuyên ngôn độc lập tại Quảng trường Ba Đình (lịch sử gọi đây là bản tuyên ngôn độc lập lần thứ 3 của Tổ quốc ta) lập nên nước Việt Nam dân chủ cộng hoà với thủ đô là thành phố Hà Nội, mở đầu một kỷ nguyên mới trong lịch sử dân tộc ta."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 106,
  "name": "Cộng hoà xã hội chủ nghĩa Việt Nam",
  "description": "Ngày 2/7/1976, nước Việt Nam thống nhất chính thức có tên Cộng hoà xã hội chủ nghĩa Việt Nam, thủ đô là thành phố Hà Nội."
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 107,
  "name": "Việt Nam thời tiền sử",
  "description": "Việt Nam có một nền văn hóa đặc sắc, lâu đời và là một xã hội đã hình thành theo chế độ nhà nước sớm nhất ở khu vực Đông Nam Á.[1]\nVăn hóa Tràng An là một trong những nền văn hóa cổ nhất ở Việt Nam, hình thành từ thời kỳ đồ đá cũ khoảng 25 Ka BP (Kilo annum before present, ngàn năm trước).\n"
},
{
  "kingdom": "Quân chủ chuyên chế",
  "capital": "Ngàn Hống (~2879 TCN – ?) Nghĩa Lĩnh (Thế kỷ XXIX TCN) Phong Châu (Tới 258 TCN)",
  "id": 108,
  "name": "Hồng Bàng",
  "description": "Hồng Bàng thị (chữ Hán: 鴻龐氏) hay Thời đại Hồng Bàng là một giai đoạn lịch sử thuộc thời đại thượng cổ của lịch sử Việt Nam.\nThời đại này dựa nhiều trên các truyền thuyết, truyện kể ở những tác phẩm như Lĩnh Nam chích quái[1] và được hợp thức hóa trở thành một giai đoạn lịch sử qua Đại Việt sử ký toàn thư[2], cuốn sử thư đã đưa Hồng Bàng thị làm Kỷ đầu tiên.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 109,
  "name": "An Dương Vương",
  "description": "An Dương Vương (chữ Hán: 安陽王), tên thật là Thục Phán Thân (蜀审判体),[2] là người lập nên nước Âu Lạc, nhà nước thứ hai trong lịch sử Việt Nam sau nhà nước Văn Lang. Niên đại trị vì của An Dương Vương được các tài liệu ghi khác nhau. Sử cũ như Đại Việt sử ký toàn thư, Khâm định Việt sử thông giám cương mục cho rằng thời gian ông làm vua Âu Lạc kéo dài 50 năm, từ 257 TCN đến 208 TCN.[3] Các sử gia hiện đại căn cứ vào Sử ký Tư Mã Thiên là tài liệu gần thời đại nước Âu Lạc nhất, cho rằng An Dương Vương và nước Âu Lạc tồn tại từ khoảng 208 TCN đến 179 TCN, tức là gần 30 năm.[4].\nVào thời kỳ Hồng Bàng cách đây 2.300 năm, ở vùng Bắc bộ Việt Nam và phía Tây tỉnh Quảng Tây (Trung Quốc) có các bộ tộc người Âu Việt sống xen kẽ với người Lạc Việt. Nhà nước Văn Lang do Hùng Vương đứng đầu cai trị người Lạc Việt. Thục Phán là vua người Âu Việt, sau 1 cuộc xung đột (sử sách không ghi rõ chi tiết), ông đã đánh bại Hùng Vương, thống nhất hai tộc Âu Việt và Lạc Việt vào chung 1 triều đình. Ông đổi quốc hiệu thành Âu Lạc, xưng là An Dương Vương, đóng đô tại Phong Khê (nay là vùng Cổ Loa, huyện Đông Anh, Hà Nội). Có ca dao:\n"
},
{
  "kingdom": "Chế độ quân chủ",
  "capital": "Giao Chỉ",
  "id": 110,
  "name": "Thời kỳ Bắc thuộc lần thứ nhất",
  "description": "Bắc thuộc lần thứ nhất (chữ Nôm: 北屬吝次一, ngắn gọn: Bắc thuộc lần 1) trong lịch sử Việt Nam kéo dài từ khoảng thế kỷ thứ 2 trước Công nguyên đến năm 40, dưới sự cai trị của nhà Triệu và nhà Hán của nền phong kiến Trung Quốc.\nDấu mốc xác định thời kỳ đầu tiên này chưa thống nhất giữa các tài liệu, do quan niệm khác nhau về nước Nam Việt và nhà Triệu.\n"
},
{
  "kingdom": "Phong kiến",
  "capital": "Phiên Ngung",
  "id": 111,
  "name": "Nhà Triệu",
  "description": "Nhà Triệu (chữ Hán: 趙朝; bính âm: Zhào cháo; Hán Việt: Triệu triều) là triều đại duy nhất cai trị nước Nam Việt (ngày nay gồm 1 phần của Miền Nam Trung Quốc và Miền Bắc Việt Nam) suốt giai đoạn 204–111 trước Công nguyên.\nNguồn gốc của nhà Triệu bắt nguồn từ Triệu Đà, một võ tướng của nhà Tần theo lệnh Tần Thủy Hoàng dẫn quân xuống chinh phạt phía Nam sông Trường Giang (khi đó là lãnh thổ của các bộ tộc Bách Việt). Ông chiếm được nhiều vùng lãnh thổ (bao gồm cả Quảng Đông và Quảng Tây), nhưng nhà Tần ở Trung Hoa đã diệt vong. Nhận thấy triều đình trung ương đã sụp đổ, Triệu Đà bèn tách ra cát cứ, dùng những lãnh thổ ông chiếm được để lập nên nước Nam Việt, sau đấy ông mở rộng xuống khu vực ngày nay thuộc Việt Nam. Sau khi nhà Hán làm chủ Trung Hoa, khi về già, Triệu Đà đã quyết định bỏ việc xưng Đế, quy phục nhà Hán (nhưng vẫn xưng Hoàng đế ở trong Nam Việt). Triệu Đà viết thư gửi cho vua Hán, trong thư Triệu Đà đã công nhận rằng mình là người Trung Hoa, nhà Triệu chỉ là chư hầu phục vụ cho nhà Hán, thay mặt hoàng đế Đại Hán để cai trị phía Nam, bản thân ông cũng chỉ coi những thần dân người Việt cổ là đám \"Man Di\" mà thôi.[1]\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 112,
  "name": "Hai Bà Trưng",
  "description": "Hai Bà Trưng (13 tháng 9 năm 14 – 5 tháng 3 năm 43) là tên chỉ chung hai chị em Trưng Trắc (徵側) và Trưng Nhị (徵貳), hai người phụ nữ được đánh giá là anh hùng dân tộc của người Việt.[5] Trong sử sách, hai bà được biết đến như là những thủ lĩnh khởi binh chống lại chính quyền đô hộ của Đông Hán, lập ra một quốc gia với kinh đô tại Mê Linh và Trưng Trắc tự phong là Nữ vương. Thời kì của hai Bà xen giữa thời kỳ Bắc thuộc lần 1 và Bắc thuộc lần 2 trong lịch sử Việt Nam. Đại Việt sử ký toàn thư coi Trưng Trắc là một vị vua trong lịch sử, với tên gọi Trưng Nữ vương (徵女王).\nNguồn sử liệu đầu tiên đề cập đến chị em Hai Bà Trưng là cuốn Hậu Hán Thư viết vào thế kỷ thứ 5 (Công nguyên) bởi học giả Phạm Diệp, cuốn sách nói về lịch sử nhà Hán từ năm 6 đến năm 189 Công nguyên. Các tài liệu cổ của Trung Quốc đề cập đến hai chị em Bà Trưng khá ngắn gọn, được tìm thấy trong hai chương của Hậu Hán Thư mô tả về cuộc khởi nghĩa của Hai Bà thời kỳ nhà Tây Hán.\n"
},
{
  "kingdom": "Chế độ quân chủ",
  "capital": "Long Biên",
  "id": 113,
  "name": "Thời kỳ Bắc thuộc lần thứ hai",
  "description": "Bắc thuộc lần thứ hai (chữ Nôm: 北屬吝次二, ngắn gọn: Bắc thuộc lần 2) trong lịch sử Việt Nam kéo dài khoảng 500 năm từ năm 43 đến năm 543, từ khi Mã Viện theo lệnh Hán Quang Vũ Đế nhà Đông Hán đánh chiếm lại bộ Giao Chỉ từ tay Trưng Vương, đến khi Lý Bí khởi binh đánh đuổi thứ sử[1] nhà Lương là Tiêu Tư năm 542 rồi lập ra nước Vạn Xuân năm 544.\nSau khi Cuộc khởi nghĩa Hai Bà Trưng thất bại, nhà Đông Hán tiếp tục duy trì sự cai trị tại bộ Giao Chỉ nhưng xoá bỏ sự tự trị địa phương. Vào cuối thế kỷ 2, nhà Đông Hán suy yếu, chiến tranh quân phiệt bùng nổ. Hán Hiến Đế bị các quyền thần thay nhau khống chế.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 114,
  "name": "Bà Triệu",
  "description": "Bà Triệu (chữ Hán: 趙婆, còn gọi là Triệu Ẩu, Triệu Trinh Nương, Triệu Thị Trinh hay Triệu Quốc Trinh, 226 – 248) là một thủ lĩnh kháng chiến thế kỷ thứ 3 tại Việt Nam.\nNăm 226, Sĩ Nhiếp mất, vua Đông Ngô là Tôn Quyền bèn chia đất từ Hợp Phố về bắc thuộc Quảng Châu dùng Lã Đại làm thứ sử; từ Hợp Phố về nam là Giao Châu, sai Đới Lương làm thái thú; và sai Trần Thì làm thái thú quận Giao Chỉ. Lúc bấy giờ, con của Sĩ Nhiếp là Sĩ Huy tự nối ngôi và xưng là thái thú, liền đem binh chống lại.\n"
},
{
  "kingdom": "Chế độ quân chủ",
  "capital": "Long Biên",
  "id": 115,
  "name": "Nhà Tiền Lý",
  "description": "Nhà Tiền Lý (chữ Nôm: 茹前李, chữ Hán: 前李朝, Hán Việt: Tiền Lý triều, 544 – 602) là một triều đại trong lịch sử Việt Nam, gắn liền với quốc hiệu Vạn Xuân. Nhà Tiền Lý kéo dài 61 năm và nước Vạn Xuân kéo dài 58 năm, tổng cộng ba đời vua, trong đó có hai vua họ Lý và một vua họ Triệu cũng được tính gộp vào nhà Tiền Lý, tương tự như Dương Tam Kha trong nhà Ngô sau đó.\nLý Bí (503 – 548) là người thôn Cổ Pháp, xã Tiên Phong, huyện Phổ Yên (nay là phường Tiên Phong, TP. Phổ Yên), tỉnh Thái Nguyên. Ông là người có công đánh đuổi quân đô hộ nhà Lương (thời Nam Bắc triều), sáng lập ra nhà Tiền Lý. Ông cũng có một người anh là Lý Thiên Bảo.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 116,
  "name": "Triệu Việt Vương",
  "description": "Triệu Việt Vương (chữ Hán: 趙越王; 524 – 571), tên thật là Triệu Quang Phục (趙光復), là một trong những nhà lãnh đạo khởi nghĩa, giành tự chủ thời Bắc thuộc ở Việt Nam cai trị từ năm 548 đến năm 571. Ông có công kế tục Lý Nam Đế đánh đuổi quân xâm lược nhà Lương, giữ nền độc lập cho nước Vạn Xuân. Năm 571, ông bị Lý Phật Tử đánh úp và thua trận. Ông tự tử ở cửa sông Đáy.\nTriệu Quang Phục là con của Thái phó Triệu Túc, người huyện Chu Diên (nay thuộc huyện Khoái Châu, tỉnh Hưng Yên). Ông được sử sách mô tả là người uy tráng dũng liệt[1]. Ông cùng cha theo Lý Nam Đế khởi nghĩa từ ngày đầu (541), có công lao đánh đuổi quân Lương về nước, được giao chức Tả tướng quân nước Vạn Xuân.\n"
},
{
  "kingdom": "Chế độ quân chủ",
  "capital": "Đại La",
  "id": 117,
  "name": "Thời kỳ Bắc thuộc lần thứ ba",
  "description": "Bắc thuộc lần thứ ba (chữ Nôm: 北屬吝次三, ngắn gọn: Bắc thuộc lần 3) trong lịch sử Việt Nam kéo dài từ năm 602 đến năm 905 hoặc năm 939. Thời kỳ này bắt đầu khi Tùy Văn Đế sai Lưu Phương đánh chiếm nước Vạn Xuân, bức hàng Hậu Lý Nam Đế, kéo dài cho đến khi Khúc Thừa Dụ tiến vào Đại La, giành quyền cai quản toàn bộ Tĩnh Hải quân năm 905 - thời Đường Ai Đế, ông vua bù nhìn trong tay quyền thần Chu Ôn.\nNăm 602, nhà Tùy sai Lưu Phương đem quân 27 dinh sang đánh nước Vạn Xuân. Vua đời thứ ba của Vạn Xuân là Lý Phật Tử sợ giặc và đầu hàng, bị bắt sang Trung Hoa. Việt Nam vào thời kỳ Bắc thuộc lần thứ 3 mà trước hết là thuộc Tùy. Thời đó, Việt Nam bị xếp làm một châu của Tùy, gọi là châu Giao (交州). Trên đường đánh Lâm Ấp quay về, Lưu Phương mắc bệnh chết.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 118,
  "name": "Mai Hắc Đế",
  "description": "Mai Hắc Đế (chữ Hán: 梅黑帝; 670 – 723), tên thật là Mai Thúc Loan (梅叔鸞),[1] là vị vua lãnh đạo cuộc khởi nghĩa chống lại sự chiếm đóng của nhà Đường ở miền Bắc Việt Nam vào đầu thế kỉ thứ 8.[2] Trong lịch sử Việt Nam, ông được xem như một vị anh hùng dân tộc.\nMai Thúc Loan sinh vào năm Canh Ngọ (670) tại thôn Ngọc Trừng, Hoan Châu, nay thuộc huyện Nam Đàn, Nghệ An. Theo Việt điện u linh, cha của Mai Thúc Loan là Mai Hoàn, mẹ là Mai An Hòa nguyên gốc Lộc Hà, Hà Tĩnh, lưu lạc sang vùng Nam Đàn, Nghệ An.[3]\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 119,
  "name": "Phùng Hưng",
  "description": "Phùng Hưng[2][3][4] (chữ Hán: 馮興; 746-789[1]/791[5]/802) , là lãnh tụ một cuộc nổi dậy chống lại sự đô hộ của nhà Đường thời Bắc thuộc lần thứ ba (602–905) trong lịch sử Việt Nam.\nBộ dã sử Việt điện u linh tập của Lý Tế Xương (nhà Trần) viết năm 1329 được cho là nguồn tham khảo chính của Đại Việt sử ký toàn thư trong ghi chép về Phùng Hưng. Việt điện u linh tập truyện Bố Cái đại vương viết:\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 120,
  "name": "Thời kỳ tự chủ Việt Nam",
  "description": "Tự chủ là thời kỳ đầu khôi phục lại nền độc lập của Việt Nam đầu thế kỷ 10 sau hơn 1000 năm Bắc thuộc. Thời kỳ này, người Việt đã tự cai trị lãnh thổ nhưng chưa xưng làm vua, và chưa đặt quốc hiệu. Bề ngoài, Việt Nam vẫn là một phần lãnh thổ của \"thiên triều\" phương Bắc ở Trung nguyên với tên gọi \"Tĩnh Hải quân\" và người đứng đầu chỉ nối tiếp nhau làm chức Tiết độ sứ như một quan cai trị của Trung Quốc trước đây.\nThời kỳ tự chủ bắt đầu từ khi họ Khúc nổi dậy nắm quyền thay các Tiết độ sứ người Trung Quốc (905) và kết thúc khi Ngô Quyền tiêu diệt Kiều Công Tiễn và đánh thắng quân Nam Hán, lập ra nhà Ngô (938).\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 121,
  "name": "Họ Khúc (lịch sử Việt Nam)",
  "description": "Họ Khúc là dòng họ nắm quyền cai trị Việt Nam đầu thế kỷ X, mở đầu Thời kỳ tự chủ Việt Nam sau hơn 1000 năm Bắc thuộc. Họ Khúc truyền nối làm chức Tiết độ sứ gồm 3 đời: Khúc Thừa Dụ, Khúc Hạo, Khúc Thừa Mỹ, cai trị từ năm 905 tới năm 923 hoặc 930.\nCuối thế kỷ IX, chính quyền trung ương nhà Đường suy yếu nghiêm trọng. Nạn cát cứ của quân phiệt địa phương ngày càng ác liệt, khởi nghĩa Hoàng Sào (874-884) làm triều đình nhà Đường càng thêm suy yếu.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 122,
  "name": "Dương Đình Nghệ",
  "description": "Dương Đình Nghệ (chữ Hán: 楊廷藝), có sách như Việt Nam sử lược của Trần Trọng Kim chép là Dương Diên Nghệ (楊筵藝, 22 tháng 11 năm 874[cần dẫn nguồn] – 937)[1], người Ái châu, làm tướng cho Khúc Hạo. Đời Hậu Lương, vì Khúc Hạo chiếm cứ đất Giao Châu, nên Nam Hán Cao Tổ Lưu Nghiễm ở đất Quảng Châu, có cớ sai Lý Khắc Chính và Lý Tri Thuận đánh chiếm Giao Châu. Kết quả của cuộc chiến này là con trai Khúc Hạo là Khúc Thừa Mỹ bị bắt, và vua Nam Hán phong Lý Tiến thay làm Thứ sử Giao Châu. Thấy vậy, tướng Dương Đình Nghệ dấy binh lên, đánh bại được Lý Khắc Chính, và vây hãm Lý Tiến. Và khi Lý Tiến được tướng Nam Hán là Trần Bảo đem quân tới cứu, Dương Đình Nghệ một lần nữa đánh bại và chém chết được Trần Bảo. Cuối cùng là Dương Đình Nghệ đã vẻ vang giữ được thành, và oai phong tự xưng là Tiết độ sứ của Giao Châu. Sáu năm sau, Dương Đình Nghệ, tuy thắng được ngoại xâm nhưng lại chết vì nội phản, bị tướng của mình là Kiều Công Tiễn làm phản, giết chết rồi lên thay.[2][3]\nDo chữ diên (延 hoặc 筵) và chữ đình 廷 gần giống nhau nên có sự \"tam sao thất bản\".\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 123,
  "name": "Kiều Công Tiễn",
  "description": "Kiều Công Tiễn (chữ Hán: 矯公羨 hoặc 皎公羨; 870 - 938) là người Phong Châu (Phú Thọ, Việt Nam), là Tĩnh Hải quân Tiết độ sứ (một chức quan đời nhà Đường) cuối cùng cai trị lãnh thổ Việt Nam trong thời kỳ Tự chủ từ năm 937 đến năm 938. Hậu duệ của ông sau này trở thành 2 trong số 12 sứ quân ở khu vực Phong Châu là Kiều Công Hãn và Kiều Thuận.\nKiều Công Tiễn vốn là hào trưởng Phong Châu (Phú Thọ) từ thời họ Khúc tự chủ. Khi vua Nam Hán xâm chiếm Tĩnh Hải quân (tên gọi Việt Nam lúc đó), bắt Khúc Thừa Mỹ, tướng cũ của họ Khúc là Dương Đình Nghệ tập hợp lực lượng ở Ái châu để chống Hán.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 124,
  "name": "Loạn 12 sứ quân",
  "description": "Loạn 12 sứ quân (chữ Nôm: 亂12使君; chữ Hán: 十二使君之亂, Thập nhị sứ quân chi loạn) là một giai đoạn nội chiến diễn ra vào cuối thời nhà Ngô, kéo dài từ năm 944 sau khi Ngô Quyền mất cho đến khi Đinh Bộ Lĩnh thống nhất đất nước, lập ra nhà Đinh năm 968, được ghi chép trong phần Bản kỷ Ngô sứ quân Ngô Xương Xí.\nCuộc loạn lạc này có nguyên nhân sâu xa từ quá trình phân hóa xã hội thời Bắc thuộc, dẫn đến việc xuất hiện tầng lớp thổ hào, quan lại có thế lực mạnh về kinh tế, chính trị và tạo ra sự phân tán cát cứ. Thực chất của cuộc nội chiến này là việc đấu tranh giành quyền lực tối cao trên đất Tĩnh Hải quân của các thủ lĩnh địa phương khi nhà Đường suy yếu, người Việt có cơ hội đứng lên tranh giành quyền lãnh đạo. Giai đoạn này có mầm mống từ đầu thế kỷ X và có cơ hội phát triển mạnh từ khi Dương Tam Kha cướp ngôi nhà Ngô, các nơi không chịu thuần phục, các thủ lĩnh nổi lên cát cứ một vùng, nhiều người còn xưng Vương như An vương Ngô Nhật Khánh, Vũ Ninh vương Nguyễn Thủ Tiệp, Quang Hiển quốc vương Kiều Thuận, Quảng Trí quân Nguyễn Khoan hoặc tranh ngôi vua như Lã Xử Bình, Dương Huy, Đỗ Cảnh Thạc, Kiều Công Hãn và đem quân đánh chiếm lẫn nhau.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 125,
  "name": "Lịch sử Việt Nam thời Lý",
  "description": ""
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 126,
  "name": "Lịch sử Việt Nam thời Trần",
  "description": ""
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 127,
  "name": "Lịch sử Việt Nam thời Hồ",
  "description": ""
},
{
  "kingdom": "Quân chủ",
  "capital": "Không rõ",
  "id": 128,
  "name": "Thời kỳ Bắc thuộc lần thứ tư",
  "description": "Thời kỳ Bắc thuộc lần thứ tư (chữ Nôm: 北屬吝次四) hay còn gọi là thời Minh thuộc trong lịch sử Việt Nam bắt đầu từ năm 1407 khi đế quốc Minh đánh bại nhà Hồ-Đại Ngu và chấm dứt năm 1427 khi Lê Lợi đánh đuổi được quân Minh ra khỏi bờ cõi, giành thắng lợi hoàn toàn trong cuộc khởi nghĩa Lam Sơn. Thời kỳ thuộc Minh chỉ kéo dài 20 năm.\nTrong những năm đầu thành lập triều Minh, Minh Thái Tổ Chu Nguyên Chương đã công khai chính sách hòa hoãn với các quốc gia nhỏ, giáp biên giới với Trung Quốc. Thậm chí, Minh Thái Tổ còn đặt ra danh sách các nước mà Trung Quốc không nên chinh phạt trong chính sách Bất chinh chư di quốc danh (不征諸夷國名 - Các nước man di không nên đánh). Nước Đại Việt (mà \"Thiên triều\" Trung Quốc quen gọi là An Nam) được đặt đầu tiên trong các nước hướng tây nam Trung Quốc.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 129,
  "name": "Khởi nghĩa Lam Sơn",
  "description": "Khởi nghĩa Lam Sơn (1418–1427) là cuộc khởi nghĩa đánh đuổi quân Minh xâm lược về nước do Lê Lợi lãnh đạo và kết thúc bằng việc thành lập trở lại nước Đại Việt và sự thành lập nhà Hậu Lê\nTrong giai đoạn đầu (1418–1423), nghĩa quân Lam Sơn gặp rất nhiều khó khăn, thường hứng chịu các cuộc càn quét của quân Minh và quân Ai Lao, chịu tổn thất lớn. Các tướng Lam Sơn là Lê Lai và Lê Thạch tử trận. Quân Lam Sơn bấy giờ chỉ có thể thắng những trận nhỏ. Nghĩa quân bắt đầu giành thế thượng phong khi Lê Lợi nghe theo Nguyễn Chích, tiến quân ra đất Nghệ An vào năm 1424. Sau nhiều trận đánh lớn với quân Minh do các tướng Minh và cộng sự người Việt chỉ huy, quân Lam Sơn giải phóng hầu hết vùng đất từ Thanh Hóa vào Thuận Hóa, siết chặt vòng vây các thành chưa đầu hàng. Ở giai đoạn cuối, sau khi tích lũy được lực lượng, quân Lam Sơn lần lượt chuyển đại quân ra Bắc, thực hiện chiến lược cơ động, buộc quân Minh phải co cụm để giữ các thành trì quan trọng. Đặc biệt với chiến thắng quyết định trong trận Tốt Động – Chúc Động, quân Lam Sơn giành được thế chủ động trên chiến trường và sự ủng hộ của dân chúng vốn khiếp sợ trước uy thế của quân Minh trước đó. Tiếp nối thắng lợi, cuối năm 1427, quân Lam Sơn triển khai chiến dịch Chi Lăng – Xương Giang, đánh tan tác lực lượng viện binh quân Minh, buộc tướng chỉ huy quân Minh trên đất Việt cũ là Vương Thông phải xin giảng hòa và được phép rút quân về nước. Sau chiến thắng, Bình Định vương Lê Lợi sai văn thần Nguyễn Trãi viết bài Bình Ngô đại cáo để tuyên cáo cho toàn quốc.[3][4] Nước Đại Việt được khôi phục, Lê Lợi lên ngôi Hoàng đế, đặt niên hiệu Thuận Thiên, mở ra cơ nghiệp nhà Lê trong gần 400 năm sau đó.\n"
},
{
  "kingdom": "Quân chủ tuyệt đối",
  "capital": "Đông Kinh (東京 1428 - 1527)",
  "id": 130,
  "name": "Nhà Lê sơ",
  "description": "Nhà Lê sơ (chữ Nôm: 茹黎初 chữ Hán: 黎初朝, Hán Việt: Lê sơ triều) là giai đoạn đầu của triều đại quân chủ nhà Hậu Lê. Đây là thời kỳ mà chế độ quân chủ chuyên chế tập quyền trong lịch sử Việt Nam lần đầu tiên đạt đến đỉnh cao của sự phát triển cũng như suy thoái của nó. Nhà Lê sơ được thành lập sau khi Lê Lợi phát động Khởi nghĩa Lam Sơn đánh bại nhà Minh. Ông đổi tên Giao Chỉ (交阯), vốn tồn tại trong thời gian nội thuộc nhà Minh, trở về Đại Việt (大越), quốc hiệu có từ đời Lý Thánh Tông.\nThời đại Lê sơ có 10 vị hoàng đế thuộc 6 thế hệ, đây là thời kỳ các hoàng đế nhà Lê nắm trọn được quyền hành, cũng là thời kỳ vĩ đại, hoàng kim của chế độ phong kiến Việt Nam. Đời Lê Thái Tổ (Lê Lợi) và đặc biệt là đời Lê Thái Tông, xã hội được đi vào ổn định, phát triển thịnh vượng một cách mau chóng sau thời kỳ chiến tranh trước đó.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 131,
  "name": "Lịch sử Việt Nam thời Lê sơ",
  "description": ""
},
{
  "kingdom": "Chế độ quân chủ",
  "capital": "Vạn Lại (tạm thời) (1533–1597) Đông Kinh (1597–1789)",
  "id": 132,
  "name": "Nhà Lê trung hưng",
  "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm.\nTừ thời Lê Uy Mục và Lê Tương Dực, chính sự nhà Hậu Lê bắt đầu suy. Các cuộc khởi nghĩa nông dân và sự tranh chấp quyền lực trong nội bộ khiến nhà Lê nghiêng ngả. Năm 1516, giữa lúc đang đối phó với lực lượng khởi nghĩa của Trần Cảo sắp đánh vào kinh thành thì trong cung đình nhà Lê xảy ra phế lập. Đại thần Trịnh Duy Sản giết chết vua Lê Tương Dực và lập vua mới Lê Chiêu Tông, mang xa giá vào Thanh Hóa.\n"
},
{
  "kingdom": "Chế độ quân chủ",
  "capital": "Vạn Lại (tạm thời) (1533–1597) Đông Kinh (1597–1789)",
  "id": 133,
  "name": "Nhà Lê trung hưng",
  "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm.\nTừ thời Lê Uy Mục và Lê Tương Dực, chính sự nhà Hậu Lê bắt đầu suy. Các cuộc khởi nghĩa nông dân và sự tranh chấp quyền lực trong nội bộ khiến nhà Lê nghiêng ngả. Năm 1516, giữa lúc đang đối phó với lực lượng khởi nghĩa của Trần Cảo sắp đánh vào kinh thành thì trong cung đình nhà Lê xảy ra phế lập. Đại thần Trịnh Duy Sản giết chết vua Lê Tương Dực và lập vua mới Lê Chiêu Tông, mang xa giá vào Thanh Hóa.\n"
},
{
  "kingdom": "Chế độ quân chủ",
  "capital": "Vạn Lại (tạm thời) (1533–1597) Đông Kinh (1597–1789)",
  "id": 134,
  "name": "Nhà Lê trung hưng",
  "description": "Nhà Lê trung hưng (chữ Nôm: 茹黎中興, chữ Hán: 黎中興朝, Hán Việt: Lê trung hưng triều, 1533–1789) là giai đoạn sau của triều đại quân chủ nhà Hậu Lê (giai đoạn đầu là nhà Lê sơ) trong lịch sử Việt Nam. Nhà Lê trung hưng được thành lập khi Lê Trang Tông với sự phò tá của cựu thần nhà Lê sơ là Nguyễn Kim được đưa lên ngôi báu. Đây là triều đại dài nhất so với các triều đại Việt Nam với 256 năm.\nTừ thời Lê Uy Mục và Lê Tương Dực, chính sự nhà Hậu Lê bắt đầu suy. Các cuộc khởi nghĩa nông dân và sự tranh chấp quyền lực trong nội bộ khiến nhà Lê nghiêng ngả. Năm 1516, giữa lúc đang đối phó với lực lượng khởi nghĩa của Trần Cảo sắp đánh vào kinh thành thì trong cung đình nhà Lê xảy ra phế lập. Đại thần Trịnh Duy Sản giết chết vua Lê Tương Dực và lập vua mới Lê Chiêu Tông, mang xa giá vào Thanh Hóa.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 135,
  "name": "Lịch sử Việt Nam thời Lê trung hưng",
  "description": ""
},
{
  "kingdom": "Quân chủ",
  "capital": "Đông Kinh",
  "id": 136,
  "name": "Nhà Mạc",
  "description": "Nhà Mạc (chữ Hán: 莫朝 / Mạc triều) là triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Mạc Đăng Dung, sau khi dẹp được các bè phái trong cung đình, đã ép vua Lê Cung Hoàng nhà Hậu Lê nhường ngôi tháng 6 năm 1527 và chấm dứt khi vua Mạc Mậu Hợp lập con trai là Mạc Toàn lên ngôi, bị quân đội Lê-Trịnh do Trịnh Tùng chỉ huy đánh bại vào cuối năm 1592 – Sau đó Mạc Toàn lên ngôi nhưng tại vị chỉ được 2 tháng, tổng cộng thời gian tồn tại chính thức của triều đại là gần 66 năm.\nTuy nhiên, giai đoạn sau đó hậu duệ nhà Mạc như Mạc Kính Chỉ, Mạc Kính Cung, Mạc Kính Khoan, Mạc Kính Vũ vẫn còn tiếp tục chống lại nhà Hậu Lê thời kỳ trung hưng đến tận năm 1677[1] tại khu vực Cao Bằng.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 137,
  "name": "Lịch sử Việt Nam thời Mạc",
  "description": ""
},
{
  "kingdom": "Quân chủ chuyên chế",
  "capital": "Đông Kinh",
  "id": 138,
  "name": "Chúa Trịnh",
  "description": "Chúa Trịnh (chữ Nôm: 主鄭, chữ Hán: 鄭王 / Trịnh vương; 1545 – 1787) là một vương tộc phong kiến kiểm soát quyền lực lãnh thổ Đàng Ngoài suốt thời Lê Trung hưng. Về danh nghĩa thì chúa Trịnh là bề tôi của nhà Lê (họ chỉ xưng tước \"vương\", vẫn dùng niên hiệu và nhận sắc phong, chiếu chỉ từ hoàng đế nhà Lê). Tuy nhiên thực tế thì vua Lê không có thực quyền, việc cai trị chủ yếu do chúa Trịnh thực hiện. Bộ máy triều đình lúc này hoạt động theo thể chế lưỡng đầu. Tổng cộng có 11 đời chúa Trịnh chính thức (nếu tính luôn cả Trịnh Kiểm là 12 đời chúa), cai quản xứ Đàng Ngoài trong hơn 2 thế kỷ.\nSau khi hoàng đế Lê Hiến Tông mất năm 1504, các hoàng đế kế vị đều yểu mạng, hoặc tàn bạo, hoặc kém tài. Đến năm 1527, quyền thần Mạc Đăng Dung cướp hoàng vị của Lê Cung Hoàng rồi sáng lập nhà Mạc. Năm 1533, ở Thanh Hóa, một võ tướng nhà Lê là Nguyễn Kim nổi dậy chống lại nhà Mạc, lập lại nhà Lê, ông tìm được hậu duệ của nhà Lê là Lê Ninh bèn lập làm hoàng đế tức là Lê Trang Tông. Trong vòng 5 năm, các vùng phía nam nằm dưới quyền kiểm soát của nhà Lê Trung Hưng nhưng họ không thể chiếm Thăng Long. Trong thời gian này, nhà Lê cũng phát triển thế lực về phía Nam, chiếm quyền kiểm soát vùng cực nam lãnh thổ nơi từng là đất đai của Chăm Pa.\n"
},
{
  "kingdom": "Quân chủ chuyên chế",
  "capital": "Ái Tử-Trà Bát (1558-1626) Phước Yên-Bác Vọng (1626-1636, 1712-1738) Kim Long-Phú Xuân (1636-1712, 1738-1775) Hội An (1775-1777) Gia Định (1777, 1780-1783, 1788-1802)",
  "id": 139,
  "name": "Chúa Nguyễn",
  "description": "Chúa Nguyễn (chữ Nôm: 主阮; chữ Hán: 阮王 / Nguyễn vương) (1558-1777, 1780-1802) là tên gọi dùng để chỉ người đứng đầu xứ Đàng Trong tức dải đất từ Thuận Hóa (phía nam đèo Ngang hiện nay) trở vào miền Nam của Việt Nam, đối lập với xứ Đàng Ngoài của các Chúa Trịnh trong thời kỳ Trịnh-Nguyễn phân tranh của lịch sử Việt Nam. Các Chúa Nguyễn bắt đầu từ đầu giai đoạn Lê Trung hưng của Nhà Hậu Lê, hay giữa thế kỷ XVI, cho đến khi bị Nhà Tây Sơn tiêu diệt vào năm 1777, tuy nhiên Nguyễn Phúc Ánh. một hậu duệ của Chúa Nguyễn đã xưng vương và đến năm 1802 thì tiêu diệt Tây Sơn và lập ra triều đại mới thông qua việc xưng đế. Các Chúa Nguyễn chính là tổ tiên của các Hoàng đế Nhà Nguyễn (1802-1945).\nNăm 1527, Mạc Đăng Dung soán ngôi Nhà Lê và lập ra Nhà Mạc. Nguyễn Kim (1468–1545), vốn là một tướng giỏi của Nhà Hậu Lê, nhờ có công giúp vua Lê chống lại Nhà Mạc nên được phong chức Thái sư Hưng Quốc công (sau này khi Nhà Nguyễn thành lập đã truy tôn ông là Triệu tổ Tĩnh hoàng đế). Nguyễn Kim có ba người con. Con gái đầu tên Ngọc Bảo, lấy Trịnh Kiểm, người sau này trở thành người mở đầu cho sự nghiệp của các Chúa Trịnh ở Đàng Ngoài; hai người con trai kế của Nguyễn Kim cũng là tướng giỏi và được phong chức Quận công. Sau khi người con trai lớn là Nguyễn Uông bị anh rể là Trịnh Kiểm giết, người con trai còn lại là Nguyễn Hoàng đã xin vua Lê cho vào cai trị vùng đất Thuận Hóa để rời xa sự kiểm soát của anh rể mà nhằm mưu đồ tạo dựng 1 cơ nghiệp riêng cho dòng họ Nguyễn, việc này dẫn đến sự chia cắt với Chúa Trịnh ở miền Bắc vào năm 1627 và hai miền chỉ được thống nhất khi quân Tây Sơn lúc đấy đang đi theo chúa Trịnh tạm thời tiêu diệt chúa Nguyễn vào năm 1777. Năm 1744, Chúa Nguyễn Phúc Khoát tự xưng tước vị \"vương\" để chứng tỏ hoàn toàn quyền lực ngang hàng với Chúa Trịnh và chỉ đứng dưới Hoàng đế Đại Việt (tức vua Nhà Lê Trung hưng).\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 140,
  "name": "Trịnh–Nguyễn phân tranh",
  "description": "Trịnh–Nguyễn phân tranh (chữ Hán: 鄭阮紛爭) là thời kỳ phân chia lãnh thổ giữa chế độ \"vua Lê chúa Trịnh\" ở phía Bắc sông Gianh (Đàng Ngoài) và chúa Nguyễn cai trị ở miền Nam (Đàng Trong), mở đầu khi Trịnh Tráng đem quân đánh Nguyễn Phúc Nguyên năm 1627 và kết thúc vào năm 1777 khi chúa Nguyễn sụp đổ.\nBan đầu, cả thế lực họ Trịnh và họ Nguyễn đều mang khẩu hiệu \"phù Lê diệt Mạc\" để lấy lòng thiên hạ và thề trung thành với triều Hậu Lê. Sau khi nhà Mạc đã bị đánh đổ, trên danh nghĩa, cả Chúa Trịnh và Chúa Nguyễn đều là 2 vị bề tôi của nhà Hậu Lê, cả Đàng Trong lẫn Đàng Ngoài đều là lãnh thổ của nhà Lê. Nhưng trên thực tế thì cả hai tập đoàn phong kiến này đều tạo thế lực cát cứ cho riêng mình như 2 nước riêng biệt, vua nhà Hậu Lê đã không còn thực quyền nên không ngăn chặn được sự phân tranh giữa hai họ Trịnh–Nguyễn. Nước Đại Việt trong giai đoạn này bị chia cắt khoảng 150 năm.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 141,
  "name": "Pháp thuộc",
  "description": "Pháp thuộc là một giai đoạn trong lịch sử Việt Nam kéo dài 61 năm, bắt đầu từ 1884 khi Pháp ép triều đình Huế kí Hòa ước Giáp Thân cho đến 1945 khi Pháp mất quyền cai trị ở Đông Dương. Tuy nhiên, nhiều tài liệu khác cho rằng thời kỳ Pháp thuộc cần được tính từ năm 1867 (tức là kéo dài gần 80 năm), khi Nam Kỳ Lục tỉnh bị nhà Nguyễn cắt nhượng cho Pháp, trở thành lãnh thổ đầu tiên Pháp chiếm được trong quá trình Pháp xâm lược Đại Nam.\nTrong thời kỳ này, Pháp thôn tính Việt Nam, Campuchia và Lào. Mất chủ quyền, Việt Nam bị chia cắt thành 3 xứ riêng biệt với ba cơ cấu hành chính riêng: xứ thuộc địa Nam Kỳ và hai xứ bảo hộ Bắc và Trung Kỳ. Cao Miên (Campuchia), Ai Lao cũng chịu sự cai trị của Pháp, và nhượng địa Quảng Châu Loan tiếp theo bị gom vào Liên bang Đông Dương.\n"
},
{
  "kingdom": "Quân chủ tuyệt đối",
  "capital": "Huế",
  "id": 142,
  "name": "Đế quốc Việt Nam",
  "description": "Đế quốc Việt Nam (chữ Hán: 越南帝國; tiếng Nhật: ベトナム帝国, chuyển tự Betonamu Teikoku, cựu tự thể: 越南帝國, chuyển tự Etsunan Teikoku, tiếng Pháp: Empire du Viêt Nam) là tên gọi chính thức của một Nhà nước Việt Nam tồn tại chỉ 5 tháng trong lịch sử Việt Nam (từ tháng 3 đến tháng 8 năm 1945) dưới sự kiểm soát và chi phối của Đế quốc Nhật Bản.\nSau khi Nhật đảo chính Pháp tại Đông Dương đêm ngày 9 tháng 3 năm 1945, Hoàng đế Bảo Đại tuyên bố Đế quốc Việt Nam độc lập với sự cộng tác với Đế quốc Nhật Bản.[1] Ngày 17 tháng 4, Nội các Đế quốc Việt Nam do Trần Trọng Kim làm Tổng trưởng (Thủ tướng) được thành lập. Tuy có nội các nhưng Đế quốc Việt Nam thực chất vẫn là nền quân chủ chuyên chế mà không phải là nền quân chủ lập hiến như ở Anh Quốc hay Hà Lan. Do Đế quốc Việt Nam không có Quốc hội, cũng không có Hiến pháp, mặt khác, Đế quốc Nhật Bản vẫn nắm quyền chi phối hoạt động của Đế quốc Việt Nam, ngay cả các Bộ trưởng của Đế quốc Việt Nam không thể làm được việc gì nếu không được cố vấn tối cao Nhật Bản đồng ý.[2]\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 143,
  "name": "Chiến tranh Đông Dương",
  "description": "Chiến tranh Đông Dương, còn được gọi là Chiến tranh Đông Dương lần thứ nhất là một cuộc xung đột diễn ra tại ba nước Đông Dương bao gồm Việt Nam, Lào và Campuchia, giữa một bên là Quân đội Viễn chinh Pháp cùng các lực lượng đồng minh bản xứ bao gồm lực lượng của Quốc gia Việt Nam, Vương quốc Lào, Vương quốc Campuchia thuộc Liên hiệp Pháp, bên kia là lực lượng Việt Nam Dân chủ Cộng hòa (Việt Minh) cùng các lực lượng kháng chiến khác của Lào (Pathet Lào) và Campuchia (Khmer Đỏ). Cuộc chiến bắt đầu từ ngày 19 tháng 12 năm 1946 khi Hồ Chí Minh ra lệnh Toàn quốc kháng chiến và kết thúc ngày 20 tháng 7 năm 1954 khi Hiệp định Genéve được ký kết. Tuy nhiên xung đột thật sự đã nổ ra từ ngày 23 tháng 9 năm 1945 khi quân Pháp theo chân quân Anh tiến vào miền Nam Việt Nam để giải giáp quân Nhật.\nĐối với Việt Nam Dân chủ Cộng hòa, đây là giai đoạn đầu tiên trong \"Cuộc kháng chiến 30 năm\" của họ với mục tiêu giành độc lập cho Việt Nam (giai đoạn 2 là cuộc chiến với Hoa Kỳ). Cuộc chiến diễn ra trên khắp Việt Nam và lan ra cả các nước láng giềng Lào và Campuchia, nhưng chiến sự chính diễn ra chủ yếu tại miền Bắc Việt Nam. Sau 9 năm sa lầy và với thất bại tại Trận Điện Biên Phủ, Pháp buộc phải chấp nhận ký kết Hiệp định Genève công nhận nền độc lập và toàn vẹn lãnh thổ của Việt Nam.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 144,
  "name": "Lịch sử Việt Nam thời kỳ 1945–1975",
  "description": ""
},
{
  "kingdom": "Đơn nhất Marx–Lenin đơn đảng cộng hòa xã hội chủ nghĩa",
  "capital": "Không rõ",
  "id": 145,
  "name": "Việt Nam Dân chủ Cộng hòa",
  "description": "Việt Nam Dân chủ Cộng hòa (VNDCCH) là một nhà nước ở Đông Nam Á được Chủ tịch Hồ Chí Minh tuyên bố thành lập vào ngày 2 tháng 9 năm 1945 với thủ đô là Hà Nội. Với Tổng tuyển cử năm 1946, Việt Nam Dân chủ Cộng hòa chính thức trở thành nhà nước có chủ quyền trên toàn bộ lãnh thổ Việt Nam[3][4], được Quốc hội Việt Nam khóa I thông qua mặc dù một số vùng lãnh thổ sau đó bị các lực lượng ngoại quốc và nhà nước khác quản lý về hành chính trên thực tế. Cuối Chiến tranh Đông Dương lần thứ nhất, lãnh thổ Việt Nam bị chia làm hai vùng tập kết quân sự tạm thời theo Hiệp định Genève. Theo Hiệp định Genève 1954, vùng lãnh thổ thuộc quản lý hành chính của Việt Nam Dân chủ Cộng hoà giáp với Trung Quốc ở phía bắc, Lào ở phía tây, và phía nam giáp với lãnh thổ quản lý bởi Quốc gia Việt Nam (tiền thân của Việt Nam Cộng hòa, sau đó được Cộng hòa Miền Nam Việt Nam tiếp quản). Cũng trong giai đoạn này, Việt Nam Dân chủ Cộng hòa cũng được gọi là miền Bắc Việt Nam (tiếng Anh: North Vietnam, nguyên văn \u0027Bắc Việt Nam\u0027) để chỉ vị trí địa lý của phần lãnh thổ Việt Nam được quản lý bởi nhà nước này theo Hiệp định Genève. Từ năm 1954–1976, Việt Nam Dân chủ Cộng hòa là nhà nước độc lập đi theo chế độ xã hội chủ nghĩa.\nTrong Chiến tranh thế giới thứ hai, Việt Nam từ chỗ là thuộc địa của Pháp đã trở thành Đế quốc Việt Nam thân Nhật Bản sau khi Pháp đầu hàng và trao toàn bộ Đông Dương cho Phát xít Nhật Bản vào tháng 3 năm 1945. Ngay sau khi Nhật Bản đầu hàng quân Đồng Minh, bao gồm cả Việt Minh ở Việt Nam và Cách mạng tháng 8 năm 1945 thành công, nước Việt Nam Dân chủ Cộng hòa được tuyên bố thành lập tại Hà Nội, chính quyền lâm thời được thiết lập trên toàn bộ đất nước. Chủ tịch Hồ Chí Minh, người lãnh đạo Việt Minh, trở thành người đứng đầu chính phủ mới và đã ngay lập tức tổ chức cuộc Tổng tuyển cử toàn quốc vào ngày 06/01/1946 để Việt Nam có chính phủ và nhà nước chính danh trên toàn quốc.[5] Ngay sau khi Pháp quay lại Việt Nam với sự hỗ trợ của Anh và Mỹ, thì Kháng chiến chống Pháp đã nổ ra vào năm 1946. Sau 9 năm chiến tranh, ngày 21 tháng 7 năm 1954, Việt Nam Dân chủ Cộng hòa giành thắng lợi, Hiệp định Genève được ký kết giữa các bên tham chiến, Việt Nam tạm thời bị chia làm 2 vùng tập kết tạm thời, lấy vĩ tuyến 17 làm ranh giới. Lực lượng quân sự của Việt Nam Dân chủ Cộng hòa tập kết về miền Bắc Việt Nam, trong khi đó, Quân đội Pháp và Quân đội Quốc gia Việt Nam (thuộc Liên hiệp Pháp) tập kết về miền Nam Việt Nam, quân Pháp sẽ rút hết khỏi Việt Nam sau 2 năm.\n"
},
{
  "kingdom": "Chính phủ lâm thời (do chưa có Quốc hội và Hiến pháp), thành viên trong Khối Liên hiệp Pháp",
  "capital": "Sài Gòn 10°48′B 106°39′Đ﻿ / ﻿10,8°B 106,65°Đ﻿ / 10.800; 106.650",
  "id": 146,
  "name": "Quốc gia Việt Nam",
  "description": "Quốc gia Việt Nam (tiếng Pháp: État du Viêt Nam) là một chính phủ thuộc Liên bang Đông Dương thuộc Liên hiệp Pháp, tuyên bố chủ quyền toàn bộ lãnh thổ Việt Nam, tồn tại trong giai đoạn từ giữa năm 1948 đến 1955. Thủ đô đặt tại Sài Gòn, nhưng quốc trưởng Bảo Đại lại sống và làm việc tại Đà Lạt.\nQuốc gia Việt Nam được thành lập theo một thỏa thuận năm 1949 giữa Bảo Đại (cựu hoàng của nhà Nguyễn) và Tổng thống Pháp. Về mặt pháp lý, có quan điểm cho rằng bản thỏa thuận này bị xem là bất hợp pháp, do Bảo Đại đã thoái vị từ ngày 25/8/1945 và chỉ còn là một công dân bình thường nên ông ta không có tư cách pháp lý để thay mặt đất nước ký thỏa thuận với Pháp (Trong khi đó Chính phủ Việt Nam Dân chủ Cộng hòa do Hồ Chí Minh làm Chủ tịch đang tiến hành kháng chiến chống Pháp). Việc thành lập Quốc gia Việt Nam bị chính quyền Việt Nam Dân chủ Cộng hòa coi như một chiêu bài của thực dân Pháp, nhằm thành lập chính phủ bù nhìn để hợp thức hóa việc xâm lược Việt Nam.[2] Vì việc thỏa hiệp với Pháp, Bảo Đại đã bị tòa án Việt Nam Dân chủ Cộng hòa kết án phản quốc từ năm 1948.[3]\n"
},
{
  "kingdom": "Cộng hòa tổng thống (1955–1956) Cộng hòa lập hiến đơn nhất tổng thống chế (1956–1963) Độc tài quân sự (1963–1967) Cộng hòa tổng thống đa đảng đơn nhất (1967–1969) Cộng hòa lập hiến độc đảng cầm quyền tổng thống chế (1969–1975)",
  "capital": "Sài Gòn 10°48′B 106°39′Đ﻿ / ﻿10,8°B 106,65°Đ﻿ / 10.800; 106.650",
  "id": 147,
  "name": "Việt Nam Cộng hòa",
  "description": "Việt Nam Cộng hòa (VNCH; tiếng Anh: Republic of Vietnam; tiếng Pháp: République du Viêt Nam, viết tắt RVN) là một nhà nước đã từng tồn tại từ năm 1955 đến năm 1975.\nTrong các tài liệu quốc tế, chính phủ này còn được gọi là South Vietnam (n.đ. \u0027Nam Việt Nam\u0027 hoặc \u0027miền Nam Việt Nam\u0027) để chỉ phạm vi địa lý kể từ khi Hiệp định Genève được ký kết và Việt Nam bị chia cắt thành hai vùng tập kết quân sự tạm thời. Với sự hậu thuẫn của Hoa Kỳ, Việt Nam Cộng hòa bác bỏ việc thực hiện tổng tuyển cử thống nhất Việt Nam vào năm 1956 theo Hiệp định Genève với lý do họ không ký hiệp định này. Chính phủ Việt Nam Cộng hòa đối chọi với Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam thành lập năm 1969 do Mặt trận Dân tộc Giải phóng miền Nam Việt Nam lãnh đạo.\n"
},
{
  "kingdom": "Chính phủ Cách mạng lâm thời",
  "capital": "Thị xã Đông Hà (1973–1975) Sài Gòn – Gia Định (1975–1976)",
  "id": 148,
  "name": "Cộng hòa Miền Nam Việt Nam",
  "description": "Cộng hòa miền Nam Việt Nam là một chính thể tại miền Nam Việt Nam, được thành lập bởi Đại hội Quốc dân miền Nam Việt Nam mà nòng cốt là lực lượng Mặt trận Dân tộc Giải phóng miền Nam Việt Nam, Liên minh các Lực lượng Dân tộc, Dân chủ và Hòa bình Việt Nam thành lập ở miền Nam Việt Nam với mục đích quản lý các vùng đất do phía Mặt trận Dân tộc Giải phóng miền Nam kiểm soát tại miền Nam Việt Nam. Đây là nhà nước lâm thời được lập ra nhằm để tăng tính hợp pháp và chính danh của các vùng mà Mặt trận Dân tộc Giải phóng Miền Nam Việt Nam kiểm soát.\nTheo Hiệp định Paris, thì Cộng hòa miền Nam Việt Nam là một trong hai chính thể tồn tại ở miền Nam Việt Nam, và là một trong ba chính thể trên lãnh thổ Việt Nam. Cộng hòa Miền Nam Việt Nam được một số các quốc gia công nhận và có quan hệ ngoại giao (tính đến 24/1/1976 thì chính thể này có tổng cộng 90 nước công nhận và thiết lập quan hệ ngoại giao, Kuwait là nước cuối cùng thiết lập quan hệ ngoại giao với Nhà nước này 24/1/1976 trước khi Việt Nam tái thống nhất hòa bình 2/7/1976)[cần dẫn nguồn]. Chính thể này tham gia ký Hiệp định Paris 1973 với tư cách là một bên tham chiến. Chính phủ này tiếp quản các lãnh thổ thuộc kiểm soát của Việt Nam Cộng hòa sau sự kiện 30 tháng 4 năm 1975. Ngày 2 tháng 7 năm 1976, Cộng hòa Miền Nam Việt Nam và Việt Nam Dân chủ Cộng hòa hợp nhất thành Cộng hòa xã hội chủ nghĩa Việt Nam dưới sự lãnh đạo của Đảng Cộng sản Việt Nam.\n"
},
{
  "kingdom": "Cộng hòa xã hội chủ nghĩa một đảng đơn nhất theo chủ nghĩa Marx-Lenin",
  "capital": "Hà Nội 21°2′B 105°51′Đ﻿ / ﻿21,033°B 105,85°Đ﻿ / 21.033; 105.850",
  "id": 149,
  "name": "Việt Nam",
  "description": "Việt Nam, quốc hiệu là Cộng hòa xã hội chủ nghĩa Việt Nam,[12] là một quốc gia nằm ở cực Đông của bán đảo Đông Dương thuộc khu vực Đông Nam Á, giáp với Lào, Campuchia, Trung Quốc, biển Đông và vịnh Thái Lan.\nLãnh thổ Việt Nam xuất hiện con người sinh sống từ thời đại đồ đá cũ, khởi đầu với các nhà nước Văn Lang, Âu Lạc. Âu Lạc bị nhà Triệu ở phương Bắc thôn tính vào đầu thế kỷ thứ 2 TCN sau đó là thời kỳ Bắc thuộc kéo dài hơn một thiên niên kỷ. Chế độ quân chủ độc lập được tái lập sau chiến thắng của Ngô Quyền trước nhà Nam Hán. Sự kiện này mở đường cho các triều đại độc lập kế tục và sau đó nhiều lần chiến thắng trước các cuộc chiến tranh xâm lược từ phương Bắc cũng như dần mở rộng về phía nam. Thời kỳ Bắc thuộc cuối cùng kết thúc sau chiến thắng trước nhà Minh của nghĩa quân Lam Sơn.\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 150,
  "name": "Lịch sử Việt Nam thời kỳ từ 1976",
  "description": ""
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 151,
  "name": "Vua Việt Nam",
  "description": "Vua nước Việt (chữ Nôm:𤤰渃越) là vị quân chủ nước Việt Nam độc lập tự chủ từ thời dựng nước đến Cách mạng Tháng Tám năm 1945, tùy thuộc vào hoàn cảnh lịch sử mà vua Việt Nam có thể mang tước hiệu khác nhau. Ở trong nước, tước hiệu tự xưng cao nhất là Hoàng đế và thấp hơn là Quốc vương hoặc Quận vương\nTrong huyền sử, khái niệm vua Việt Nam đã thấy ghi chép từ thời Hồng Bàng (các Hùng Vương với nước Văn Lang), nhưng còn nhiều điểm nghi vấn mơ hồ chưa thể khẳng định rõ ràng.[a] Sau đó, An Dương vương cướp ngôi họ Hùng lập ra nhà Thục với nước Âu Lạc rồi họ Triệu (Triệu Đà) lấy nước của nhà Thục. Thế nhưng, Hồng Bàng thị là dòng dõi Thần Nông thị,[1] Thục Phán An Dương vương là hậu duệ Khai Minh thị[1] còn Triệu Đà cũng là người Hán...[2] Như vậy, những triều đại sơ khai đều có sự nghi vấn gây tranh cãi. Trong ngàn năm Bắc thuộc từng trỗi dậy những chính quyền nhưng thời gian tồn tại chưa được bao lâu đã bị dẹp yên, sự nghiệp chưa ổn định lâu dài nên chưa thể cấu thành triều đại. Từ khi họ Khúc giành lấy quyền tự chủ cho đến hết loạn 12 sứ quân, danh nghĩa Việt Nam vẫn chỉ là một phiên trấn của Trung Quốc với cái tên Tĩnh Hải quân, các nhà lãnh đạo Việt Nam thời tự chủ chỉ ở mức Tiết độ sứ cả trong nước và ngoại giao, đến lúc Ngô Quyền đánh đuổi quân Nam Hán mới tự xưng Vương. Bắt đầu từ đấy, vua Việt Nam mới chính thức được xác định, tuy nhiên, nhà Ngô vẫn chưa đặt quốc hiệu. Bấy giờ bên Trung Quốc cũng đang loạn to, chính quyền trung ương còn mải lo đánh dẹp nên chưa thể nhòm ngó xuống mạn cực nam, chỉ có nước Nam Hán kế cận thỉnh thoảng xung đột mà thôi. Đến thời nhà Đinh, đối với thần dân trong nước, các vua người Việt đã xưng hoàng đế và đặt quốc hiệu là Đại Cồ Việt, gặp lúc nhà Tống cũng mới chấm dứt cục diện Ngũ đại Thập quốc nên sai sứ sang sắc phong vua Đinh làm Giao Chỉ quận vương, từ đó nền quân chủ Việt Nam mới được xác lập.[b]\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 152,
  "name": "Nguyên thủ Việt Nam",
  "description": ""
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 153,
  "name": "Quốc gia cổ trong lịch sử Việt Nam",
  "description": "Trên lãnh thổ của nước Việt Nam hiện đại, bên cạnh Văn Lang là quốc gia tiền thân của Việt Nam, đã từng có mặt các vương quốc cổ và tiểu quốc cổ khác đã bị diệt vong:\n"
},
{
  "kingdom": "Không rõ",
  "capital": "Không rõ",
  "id": 154,
  "name": "Niên biểu lịch sử Việt Nam",
  "description": "Niên biểu lịch sử Việt Nam là hệ thống các sự kiện lịch sử Việt Nam nổi bật theo thời gian từ các thời tiền sử, huyền sử, cổ đại, trung đại, cận đại cho tới lịch sử hiện đại ngày nay.\n25.000 TCN–7.000 TCN Văn hóa Soi Nhụ\n"
},
]